{
    "Morphologie": "Regel Bienen ca. 10 mm lang, kleinsten 1,5 mm lang. Holzbienen 28 mm lang. Megachile pluto gilt größte Biene fast 40 mm Länge. Bienen insektentypische Dreiteilung Körpers vier Flügeln, Wespentaille Aculeata, sowie Wehrstachel. phylogenetisch Legebohrer entwickelt, Weibchen Stachel. besonderes Merkmal Behaarung Bienen, wobei stets mindestens Haare gefiedert. Häufig Hinterbeine ( Beinsammler ) Unterseite Hinterleibs ( Bauchsammler ) besonders stark behaart. Vielfach dient Behaarung Pollentransport. Gerade verzweigten Härchen Pollen hängen bleiben. Besuch mehrerer Blüten trägt Biene maßgeblich Bestäubung. Kuckucksbienen Behaarung oft stark reduziert, fast immer Propodeum erhalten. Basitarsus Hinterbeine sowohl Männchen Weibchen abgeflacht ( Gegensatz Grabwespen ). Füßen meist Krallen Haftlappen. Antennen gekniet ( d. h. erste Antennenglied deutlich länger folgenden ). Männchen 13, Weibchen 12 Antennenglieder ( Ausnahme Pasites Biastes ). Mundwerkzeuge Rüssel umgestaltet, Mandibeln ( Oberkiefer ) jedoch Beißorgane.",
    "Ökologie, Ökonomie": "Bienen erheblichem Maße Erhaltung Wild- Kulturpflanzen deren Erträgen beitragen, ökologische Bedeutung beträchtlich; Bienen zählen weltweit wichtigsten Bestäubern. Umweltschutzorganisation Greenpeace liegt Gegenwert jährlichen Bestäubungsleistung weltweit rund 265 Milliarden Dollar. zusammenhängende ökonomische Bedeutung dadurch deutlich, Beispiel Deutschland derzeit 80.000 Imkern zirka Million Bienenvölker gehalten. decken etwa 25.000 Tonnen Honig pro Jahr etwa 20 % heimischen Bedarfs. Seit Jahren zunehmendes sogenanntes „ Bienensterben “ beobachtet. Messgröße Imkerei bezieht Ausdruck Tod einzelner Bienen, Völkerverluste Honigbiene. Dabei verbergen Schlagwort ganz unterschiedliche Phänomene: etwa Verschwinden ganzer Bienenvölker mitten Saison, insbesondere USA ( „ Colony Collapse Disorder “ ), ungewöhnlich hohe Winterverluste ( Beispiel Deutschland Winter 2002/2003 ). Mitte Dezember 2017 erklärte New York tagende Generalversammlung Vereinten Nationen Vorschlag Slowenien Unterstützung EU-Staaten 20. Mai „ Welttag Bienen “: „ Bildung Aktivitäten Bewusstsein Wichtigkeit Bienen Bestäubern, Gefahren, denen ausgesetzt, sowie Beitrag nachhaltige Entwicklung erhöht “.",
    "Systematik, Verbreitung und Evolution": "Weltweit Zahl Bienenarten rund 20.250 geschätzt. Europa 2000 Arten heimisch, davon etwa 600 Deutschland. Besonders artenreiche Gattungen Lasioglossum, Andrena Megachile jeweils mehr 1.500 Arten. Wehrstachel verfügenden Bienen gehören Stechimmen.",
    "Verbreitung und Artenvielfalt": "Artenvielfalt Wirbellosen wurde bislang kaum untersucht, entspricht sicherlich groben Regel: „ Je wärmer feuchter, desto häufiger “. Untersuchung Bienenarten Erde ergab Gegensatz „ üblichen “ Verteilungsmuster jedoch Bild: Bienen leben Kontinenten außer Antarktika. Neben erwartungsgemäß „ geringen “ Artenzahlen Arktis meisten kaltgemäßigten Regionen kühlgemäßigten maritimen Gebiete Nordamerikas Asiens sowie ganz Patagonien auffallend, Bienen extrem artenreichen Tropen Ausnahme tropischer Gebirge „ geringen “ Artenzahlen vertreten. Schwerpunkt weltweiten Bienenartenvielfalt liegt gesamten südlichen nördlichen Subtropen – ausgenommen lediglich Sahara „ geringen “ „ geringen “ Werten, „ mittleren “ Australiens Trockengebieten „ geringen “ Artenvielfalt Wüsten Nahen Ostens – sowie tropischen Hochgebirgen eher kontinental-gemäßigten Regionen Nordamerikas, kühlen Trockengebieten Steppen Zentralasiens Laubwaldgebieten Ostasiens.",
    "Entwicklungsgeschichte": "Heutige Bienen Blütenpflanzen, Bedecktsamer ( Angiospermen ), angewiesen, Erdgeschichte frühen Kreidezeit auftauchten seit späten Kreidezeit Nacktsamer Gefäßsporenpflanzen verdrängten. Blütenpflanzen Zeit etwa 110 Millionen Jahren weisen bereits Merkmale, Bestäubung Bienen schließen lassen, Ursprung Bienen liegt wahrscheinlich schon Mitte Kreidezeit. Möglicherweise Pflanzen schon früher verbreitet, lassen geringeren Mengen produzierten Pollens nachweisen. Genanalysen Fossilienfunde wurden 2023 dahingehend interpretiert, Bienen westlichen Gondwana ( Gebiet heutigen Afrikas Südamerikas ) entstanden, kurze Zeit Auseinanderdriften westlichen Gondwanas. heutigen ursprünglichsten Blütenpflanzen Käfern bestäubt, liegt daher nahe, Bestäuber ersten kreidezeitlichen Blütenpflanzen vermuten. weiteren Verlauf Stammesgeschichte Bienen Blütenpflanzen gemeinschaftlich entwickelt gegenseitig gefördert: Bienen Pollen Pflanze Pflanze trugen, verbesserten deren Fortpflanzungschancen. Pflanzen begannen darauf einzustellen entwickelten süße Säfte, Tiere binden. Zeit passten beide, Bienen Blütenpflanzen, immer besser aneinander ( Ko-Evolution ): Pflanzen entwickelten heutigen Blütenformen tiefen Nektarkelchen Staubfäden, Bienen langen Rüssel, gut Nektar heranzukommen, speziell Pollentransport angepasstes Haarkleid. Bienen ursprünglich Pollen windbestäubter Pflanzen ernährten, ungewiss, schon mehrfach vermutet worden. älteste fossile Biene Cretotrigona prisca bezeichnet wurde – eingebettet Bernstein – amerikanischen Staat New Jersey gefunden. Fund Alter ca. 75 92 Millionen Jahren datiert. Bemerkenswert, Tier Tribus ( Meliponini ) eingegliedert, ausschließlich staatenbildende Arten enthält, frühe Abspaltung entsprechenden Teilgruppe schließen lässt. Ursprünglich wurde sogar lebenden Gattung beschrieben. Stammesgeschichtliche Vorläufer Bienen dürften heutigen Grabwespen geähnelt. Grabwespen versorgen Brut Nahrungsvorrat, Beutetier Stich lähmen gemeinsam Ei Eiern vergraben. Brutverhalten ähnelt heutigen Solitärbienen, Unterschied, letztere Beutetier, Pollen Nahrungsvorrat Nachwuchs verwenden. anzunehmen, Bienen Schwestergruppe Teilgruppe Crabronidae ( Ammoplanina ) dürften.",
    "Phylogenetische Systematik": "monophyletische Status Bienen zahlreiche gemeinsame abgeleitete Merkmale ( Synapomorphien ) belegt gilt unbestritten. Ebenso unbestritten nahe Verwandtschaft Bienen Grabwespen. Lange Zeit betrachtete beide Gruppen Schwestergruppen, Grabwespen paraphyletisch erkannt wurden. Zusammenfassung Grabwespen Familie ( Sphecidae ) Überfamilie ( Sphecoidea ), Bienen Form Überfamilie Apoidea gleichrangig gegenübergestellt, gibt tatsächlichen systematischen Verhältnisse unbefriedigend. Passender wäre Eingliederung Bienen einzige Familie mehreren Familien Grabwespen. Andererseits innerhalb Bienen Unterscheidung mehrerer Familien längst etabliert. deutliche Unterschiede Körperbau erscheint gerechtfertigt Basis weiterer Unterteilungen unteren taxonomischen Ebenen. Kompromiss, führenden Systematikern Gruppe vorgeschlagen, fasst Überfamilie Apoidea Familien Grabwespen Bienen zwei Serien ( Spheciformes Apiformes ) zusammen.",
    "Familien der Bienen": "Unterteilung Bienen mehrere Familien basiert Bau Mundwerkzeuge, wichtiges Merkmal etwa Unterscheidung kurz- langzüngigen Bienen. Plant & Paulus ( 2006 ) Bienen folgende Familien Unterfamilien untergliedert: Klade I: Kurzzungige Bienen Halictidae: etwa 4.400 Arten, knapp 80 Gattungen, Unterfamilien: Halictinae, Nomioidinae, Nomiinae, Rophitinae ( =Dufoureinae ); Gattungen Mitteleuropa ( ): Furchenbienen ( Halictus Lasioglossum ), Spiralhornbienen, Dufourea, Rhophitoides, Rophites, Nomia, Nomioides, Sphecodes Andrenidae: knapp 3.000 Arten, 46 Gattungen, Unterfamilien: Andreninae, Panurginae, Oxaeinae ( teilweise eigene Familie betrachtet ); Gattungen Mitteleuropa Sandbienen, Zottelbienen, Camptopoeum, Panurginus, Melitturga Stenotritidae: 21 Arten, 2 Gattungen, Australien beschränkt ( teilweise Colletidae gestellt ) Colletidae: ca. 2.500 Arten, 90 Gattungen, Großteil Kropfsammler, Unterfamilien: Diphaglossinae, Colletinae; Mitteleuropa vertreten Seidenbienen Maskenbienen Klade II ( Melittidae + Langzungige Bienen ) Melittidae: etwa 200 Arten, 14 Gattungen, Unterfamilien: Dasipodainae, Melittinae, Meganomiinae; Galten „ kurzzungig “, Schwestergruppe ( Megachilidae + Apidae ). Mitteleuropa: Hosenbienen, Schenkelbienen Sägehornbienen Langzungige Bienen: Megachilidae: ca. 2.135 Arten, 76 Gattungen, Unterfamilien: Pararhophitinae, Fideliinae, Lithurginae, Megachilinae; Bauchsammler, Mitteleuropa Gattungen Osmia, Hoplitis, Hoplosmia ( Mauerbienen ), Anthidium, Lithurgus, Stelis, Dioxys, Megachile, Coelioxys, Chelostoma, Heriades Apidae: ca. 6.035 Arten, 172 Gattungen, Unterfamilien: Nomadinae, Xylocopinae, Apinae; unterschiedlicher Formen, Mitteleuropa folgenden Tribus Gattungen: Tribus Nomadini: Ammobates, Pasites, Ammobatoides, Biastes, Epeolus, Triepeolus Nomada Tribus Xylocopini: Holzbienen ( Xylocopa ) Ceratina Tribus Apini: Epeoloides, Eucera, Tetralonia, Anthophora, Melecta, Thyreus, Hummeln, Kuckuckshummeln sowie Honigbienen ( Apis ). Neotropis z. B. Meliponini ( Melipona Trigona ) Euglossini ( Euglossa, Eulaema, Eufriesea, Exaerete Aglae ). älteren Werken Familie Apidae oft beschränkt Körbchensammler übrigen Gruppen Familie Anthophoridae abgespalten. Wegen paraphyletischen Status Anthophoridae gilt Sichtweise überholt. Körbchensammler, traditionell geschlossene Gruppe angesehen ( Apinae ), bestehen folgenden Tribus: Apini Honigbienen ( Apis ): 9 Arten, davon Mitteleuropa Westliche Honigbiene heimisch Bombini Hummeln ( Bombus ) Meliponini: Stachellose Bienen ( 23 Gattungen ), kommen Tropenregionen, besonders artenreich Mittel- Südamerika Euglossini: 5 Gattungen",
    "Der Stachel": "Giftstachel Bienen Wehrstachel. Laufe Entwicklungsgeschichte ( Evolution ) Eilegeapparat gebildet. Folglich stets Weibchen, Königinnen Arbeiterinnen, Stachel. gilt Stechimmen. Männchen grundsätzlich stechen. Pflanzenwespen benutzen Stachel Anstechen Pflanzen Eiablage; Legimmen, etwa Schlupfwespen, Ei Körper Wirtstieres abgelegt. Stechimmen wandelte Funktion Stachels; dient Verabreichung Gift, Beutetiere lähmen, Larvennahrung dienen. Schließlich Bienen, Larven überwiegend Blütenpollen versorgen, Stachel reine Verteidigungsfunktion. Besondere Bedeutung dabei Verteidigung Staates staatenbildenden Bienen, Honigbienen Hummeln. Stachel Honigbienen Widerhaken ausgestattet, bleibt beim Stich elastische Haut Menschen Warmblüter stecken Biene stirbt. Stich injizierte Giftmenge 0,1 mg angegeben. meisten Wildbienen Stachel eingesetzt, Biene individuell bedroht fühlt, z. B. Fingern gedrückt. Meistens Stichen Wildbienen Schmerz stark harmlos. Lediglich allergisch, Wildbienen selten, besteht echte Gefahr. Maskenbienen Sandbienen Stachel schwach, menschliche Haut gar durchdringen. Tropen gibt Stachellose Bienen ( Meliponini ), Bissen Sekreten wehren.",
    "Politik": "„ Rettet Bienen “ Anfang 2019 Motto Volksbegehrens Bayern, Ziel setzte, Artenvielfalt fördern Insektensterben aufzuhalten. 18,4 % stimmberechtigten Bayern dafür Unterschrift abgegeben. Maßnahmenkatalog beinhaltet einschneidende Veränderungen. Brandenburg gleich zwei konkurrierende Volksinitiativen Thema gestartet, Dezember 2019, Februar 2020, dabei Initiativen eher Umweltverbänden unterstützt, zweite, weniger strenge Landnutzern. Brandenburger Landtag erklärte allerdings März 2020 Initiativen unzulässig. Bundesregierung beschloss 2019 Aktionsprogramm Insektenschutz.",
    "Unterteilungen zur Artenvielfalt": "== Einzelnachweise =="
}