{
    "Verbreitung und Lebensräume": "Katzen heute Kontinenten Ausnahme Antarktis verbreitet. natürliche Verbreitung umfasst Eurasien einschließlich Inseln Südostasiens, Afrika sowie Nord- Südamerika. 45 Katzenarten kommen vier Europa, neben weit verbreiteten Europäischen Wildkatze Eurasischen Luchs, Pardelluchs Spanien Portugal Falbkatze Sizilien Sardinien. Pardelluchs dabei einzige Katze, ausschließlich Europa vorkommt. 22 etwa Hälfte heute lebenden Katzenarten kommen Asien, 14 Verbreitungsgebiete Asien begrenzt. Afrika kommen 10 Katzenarten, davon allerdings drei ausschließlich Kontinent. amerikanischen Kontinenten leben 18 19 Arten Katzen, davon lebt Kanadische Luchs ausschließlich Nearktis Norden Nordamerika Rotluchs Nordamerika Norden Mexiko begrenzt. meisten Arten neotropischen Regionen finden, davon zehn Südamerika drei weitere marginalen Verbreitungsgebieten nördlich Mexiko. Katzen kommen zudem fast Lebensräumen, wobei viele Arten enge Bindung spezifischen Lebensraum. Höhenlagen Flachland Gebirge finden, Höhenverbreitung reicht dabei etwa 6000 Meter Himalaya. Australasien Ozeanien Katzen Form Hauskatze Siedler Reisende eingeführt worden. Polarregionen nördlich 70. Breitengrades kommen Katzen. ursprünglichen Lebensräume Katzen Wälder heute leben meisten Arten Waldgebieten, tropischen Regenwäldern. 89 % Katzenarten kommen Wäldern offeneren Waldgebieten. borealen Nadelwälder Kanadas nördlichen Eurasiens dabei artenärmsten Gebiete. Regionen Luchse angepasst, russische Taiga Tundragebiete vordringen entsprechend angepasst. Wäldern gemäßigten Zone Eurasiens lebt Europäische Wildkatze, Nordamerika Rotluchs Lebensräumen finden gemäßigten Waldzonen Südamerikas Chilenische Waldkatze finden. größte Artenvielfalt tropische Waldgebiete, denen etwa 20 Katzenarten anzutreffen. Sieben strikt tropischen Regenwälder begrenzt, darunter etwa Nebelparder, Marmorkatze, Borneo-Goldkatze, Flachkopfkatze Langschwanzkatze. häufig Vegetation lebenden Arten aufgrund versteckten Lebensweise Regel wenig erforscht meisten Kenntnisse stammen Kamerafallen Beobachtungen Gefangenschaft gehaltenen Tieren. Hochgebirgen kommen spezialisierte Katzenarten. Bergkatze etwa lebt südamerikanischen Anden Höhen 3000 mehr 5000 Metern. asiatischen Hochgebirgen Schneeleopard Manul finden. Wüstenbewohner Sandkatze, Trockengebieten Mittleren Ostens vorkommt, Schwarzfußkatze Wüsten- Halbwüstengebieten Südafrikas. Sowohl Wüstenarten Manul trockene Regionen angepasst lange Zeit Wasseraufnahme überleben. Leopard kommt ebenfalls Halbwüsten Steppengebieten, afrikanischen Savannen leben zudem Geparde Löwen sowie Serval Karakal. Arten anpassungsfähige Generalisten kommen große Gebiete verschiedensten Lebensräumen. leben Regel, ausreichend Beutetiere finden. gehören etwa Puma weiten Teilen Nord- Südamerikas sowie Leopard, südlichen Afrika weite Teile Nordafrikas, mittleren Osten Südasien Nordosten Russlands anzutreffen. Europäische Wildkatze sowohl Europa Asien Afrika große Regionen verbreitet. Generalisten ganz großen Verbreitungsgebiet Colocolo Südamerika sowie Bengalkatze Asien. Kommen mehrere Arten gemeinsam Lebensraum, sympatrisch,, unterscheiden Regel Größe Beutetiere. erbeuten Leoparden Indien Regel eher kleine mittelgroße Beutetiere ebenfalls lebenden Tiger große Tiere erbeuten. Afrika jagen Leoparden Löwen gleichen Beutetiere, Leoparden bringen Beute jedoch Bäume Löwen geschützt. tropischen Regionen Südamerikas jagen Jaguare eher dichteren Vegetationsbeständen, Pumas bevorzugen offenere Gebiete.",
    "Lebensweise": "meisten Katzenarten Einzelgänger. Männliche weibliche Tiere kommen lediglich Paarung zusammen trennen anschließend. Ausnahmen bilden insbesondere Löwen, größeren Rudeln leben, sowie kleinere Gruppen zusammenlebender Männchen Geparden.",
    "Kommunikation": "Katzen weisen, verglichen Säugetieren, relativ großes Spektrum Kommunikationsformen. insbesondere Hauskatzen seit Jahrhunderten Umgebung Menschen leben, gibt Lautäußerungen mehrere Benennungen, darunter etwa „ miauen “, „ fauchen “ „ schnurren “. Katzenlauten spricht etwa „ brüllen “, „ zischen “, „ brummen “ „ knurren “. wild lebenden Katzenarten meisten Laute allerdings selten hören, meisten Arten Einzelgänger leben entsprechend selten akustische Kommunikation Artgenossen vorkommt. Forschung Kommunikation findet entsprechend Gefangenschaft gehaltenen Tieren statt entsprechend Wissen Kommunikation vielen Arten begrenzt vorhanden. Säugetiere kommunizieren Katzen akustischen Signalen kurze, mittellange lange Distanzen. kurze Distanz akustische Kommunikation meist verbunden optischen Signalen spezifischer Ohrstellung, Schwanzbewegungen, Zähne zeigen Körperhaltung, kommunizierenden Tiere einander sehen. Besonders ausgeprägt Drohungen Rivalitäten. Kommunikation Muttertieren Jungtieren Paarung spielen Berührungen große Rolle. Chemische Reize Geruchsstoffe Urin, Faeces Analdrüsensekreten spielen dagegen Kommunikation Reviergrenzen Rolle. Lautere Rufe kommen sowohl Weibchen Männchen dienen Abgrenzung Reviere Anlocken Fortpflanzungspartnern. meisten Katzen Laute denen Hauskatze identisch vergleichbar bauen typischen miauen. vielen Arten Serval, Karakal, Afrikanischen Goldkatze Marmorkatze entsprechen denen Hauskatze, Jaguarundi, Sandkatze Fischkatze dagegen stark abgeleitet unterschiedlich ausgeprägt. stößt Jaguarundi schrille, hochfrequente Pfiffe, Sandkatze Fischkatze dagegen Sequenzen kurzer bellender Laute. mittelgroßen Arten Nebelparder, Puma Gepard Rufe dagegen weniger strukturiert zeigen klaren Sequenzen. Großkatzen Tiger, Jaguare, Leoparden Löwen meist artspezifische Rufmuster. einzige soziale, Gruppen lebende Art, produzieren Löwen zahlreiche verschiedene Laute innerartliche Kommunikation kommunizieren gemeinsam „ Chöre “ längere Distanzen, wobei Muster Rufe einzelnen leisen Rufen startet Dauer schneller lauter. typische Brüllen Löwen dauert dabei etwa 40 Sekunden besteht 25 30 Einzelrufen.",
    "Ernährung": "viele Raubtiere, mehr weniger Allesfresser, ernähren Katzen fast ausschließlich Fleisch vergleichsweise hohen Proteinbedarf. meisten Daten Nahrungszusammensetzung Katzen stammen dabei Untersuchungen Faeces Mageninhalten toter Tiere, wenigen großen Arten Jagd Fressverhalten direkt beobachtet. Umweltfaktoren Lebensräume Niederschläge, Jahreszeiten Verfügbarkeit Nährstoffen Umwelt bestimmen Primärproduktion Biomasse Beutetierarten. Verteilung Umwelt bestimmen wiederum Größe Dichte Raubtierpopulation, Populationsstruktur Sozialverhalten Katzen. bestimmen Größe Verbreitungsgebiets Überlappung Verbreitungsgebiete einzelnen Raubtierarten, wobei Größe Verbreitungsgebiets Überlappung Verbreitungsgebiete einzelnen Arten häufig umgekehrt Biomasse Beutetiere korreliert. Tiere spezialisierte Raubtiere, wobei Fleischbedarf, Art Beute Jagdverhalten dabei abhängig Körpergröße Tiere. Fleischfresser ernähren optimal, Lage, größte geeignete Beutetierart fressen, gefahrlos töten. Dadurch gibt Raubtierart unterschiedliche Menge Verteilung Beutetieren, gefressen. Zudem variiert Ernährung je individuellen arteigenen Beutepräferenzen, lokalen Beutetierarten, zeitlicher Verfügbarkeit Beute Vorhandensein Konkurrenten. Großkatzen Tiger, Löwen Jaguare jagen große Beutetiere dabei große Huftiere Körpergrößen, eigene deutlich übertreffen. benötigen große Mengen Fleisch Regel überleben, Revieren entsprechend großen Beutetiere gibt. Dabei häufig abhängig wenig Beutearten. erbeuten Regel etwa Beutetier pro Woche, Tage ernähren paar Tage Nahrung brauchen. Sender ausgestattete Tigerweibchen tötete etwa sieben neun Tage Wildschwein Hirsch kam Jahr etwa 40 46 Tötungen zwei Jungtieren etwa 60 72 Tötungen Jahr durchführte, Jungen versorgen. Pumas, Leoparden, Schneeleoparden Geparde jagen kleine mittelgroße Beutetiere, wobei Beutespektrum Regel weit; Pumas entsprechend mehr 60 verschiedene Beutetierarten angegeben, kleinen Hörnchen ausgewachsenen Elchen, Leoparden mehr 90 Arten potenzielle Beutetiere dokumentiert. variieren Beutetiere je Verfügbarkeit Hasen großen Antilopen Kudus. Untersuchungen Gabun ergaben Beutespektrum Tieren 2 100 Kilogramm Körpergewicht, wobei Huftiere Gewicht 5 50 Kilogramm weitaus größten Anteil darstellten. Vergleich Beutetieren asiatischen afrikanischen Leoparden zeigte, Asien beobachteten Tiere kaum Beutetiere Gewicht 5 Kilogramm erbeuteten durchschnittliche Beutetiergröße insgesamt eher größer. meisten Kleinkatzen Generalisten erbeuten meistens kleine Beutetiere Nagetiere Hasenartige, Reptilien, Amphibien Insekten jagen. Arten Ozelot, Leopardkatze, Serval, Manul, Europäische Wildkatze Schwarzfußkatze erbeuten kleine Nagetiere, Luchse jagen fast ausschließlich Hasen Kaninchen. wenige Arten Fischkatze Flachkopfkatze jagen Fische Frösche Gewässern darauf spezialisiert. freier Natur bevorzugen meisten Katzen zudem lebend gefangene Beute fressen gelegentlich Aas. Arten jagen allerdings Beute ab, Gelegenheit. übernehmen Löwen regelmäßig Beute Geparden Leoparden Pumas Beute Rotluchsen. Leoparden fressen zudem Aas überbrücken Zeiten, denen wenig Beute Verfügung steht. Rotluchse Winter wichtig, Aas verstorbenen Hirschen finden Nahrungsgrundlage sichern. Jagdweise ähneln meisten Katzen. lauern Beute Ansitzjäger schleichen nahe heran, wenigen Sätzen kurzen Sprint überwältigen. Anschleichens halten Tiere möglichst nah Boden angelegten Ohren visieren Beute gerichteten Augen. Dabei bewegen langsam vorsichtig, Geräusche vermeidend, potenzielle Beute. teilweise mehr halbe Stunde dauern immer, anvisierte Beute Kopf hebt Richtung Katze blickt, bleibt stehen verharrt bewegungslos. Katze nah genug Beute, schnellen Sprint erreichen überwältigen, rennt los verfolgt Beute, erwischt. Sprint ganz besonderem Maße Geparden entwickelt, Erreichen hoher Geschwindigkeiten ( 100 km/h ) eingerichtet. anvisierte Beute Distanz hundert Metern verfolgen. Unzutreffend dagegen Vergleich Jagdmethode Hetzjagd rudeljagender Caniden Tüpfelhyänen: Gegensatz Hetzjägern Geparde Beute gerade Ausdauer erschöpfen ( worin Prinzip Hetzjagd besteht ), müssen binnen kurzer Zeit ( kaum mehr Minute ) höhere Geschwindigkeit einholen. Katze Beute erreicht, greift Krallen setzt Tötungsbiss. Kleine Beutetiere dabei Regel Nacken gebissen, großen Beutetieren erfolgt Biss meist Hals, Luftröhre zerstören. Daneben verschiedene Arten artspezifische Methoden Beutefang Tötung Beute entwickelt.",
    "Fortpflanzung und Entwicklung": "meisten Katzenarten Einzelgänger direkte Begegnungen Artgenossen vermieden, reduzieren Zeit Fortpflanzung. Geschlechter kommunizieren Paarungsbereitschaft dabei Düfte Weibchen hinterlassen Duftmarken Urin Umfeld Reviere, Männchen aufgespürt. Zudem kommunizieren Weibchen verschiedener Arten fruchtbaren Phasen Rufe, paarungswillige Männchen anlocken. Regel nähern Männchen Weibchen verfolgen, teilweise mehrere Tage, gewissen Gewöhnung verpaaren, Weibchen bereit. rasche Annäherungen dagegen aggressivem ablehnendem Verhalten Weibchen führen, denen Extremfall Partner getötet. Paare bleiben Regel Tage beisammen meisten Arten locken Weibchen mehr Männchen, paaren möchte. Tigern, Jaguaren, Pumas Luchsen wurden mehrfach mehrere Männchen beobachtet, einzelnen Weibchen folgen. Sobald Weibchen paarungsbereit, Männchen Rivalenkämpfen kommen. Paarung besteigt Männchen Weibchen greift Zähnen Nacken. Ende Paarung windet Weibchen Männchen hervor wirft ab. Paarung kurz dauert Regel etwa 3 20 Sekunden, allerdings kommt meisten Katzen zahlreichen Paarungen mehrere Tage. Löwen liegen Beobachtungen, denen Paar 157 mal innerhalb mehr 55 Stunden kopulierte. Ähnlich häufig Verpaarungen Tigern, Leoparden Jaguaren, kleineren Katzen deutlich weniger häufig stattfinden. meisten tropischen Regionen lebenden Katzen geht davon, mehrfach Jahr paarungsfähig ( polyöstrisch ), einzelne Arten gemäßigten polaren Regionen harschen Kältezeiten feste Fortpflanzungsphase ( monoöstrisch ). Eisprung meisten Katzen wahrscheinlich erst Paarung induziert, Wahrscheinlichkeit Befruchtung Eizelle erhöhen, findet entsprechend erst kurz Paarung statt. Stimulation erfolgt Haken Stacheln Penis Männchens. Erfolgsrate Befruchtung trotz induzierten Eisprungs Katzen vergleichsweise gering eingeschätzt. Löwen Tigern finden demnach 20 40 % Paarungen befruchteten Eizellen, Leoparden, Pumas Schneeleoparden Ozelots liegen Schätzungen 50 67 % Erfolgsraten. Spontane, induzierte, Eisprünge Hauskatzen, Rotluchsen Kanadischen Luchsen sowie Gefangenschaft gehaltenen Großkatzen dokumentiert. meisten Arten trennen Paare Männchen verlassen Reviere Weibchen, allein Nachwuchs kümmern. Ausnahmen bilden dabei Familiengruppen lebenden Arten Löwen Geparde. Tragzeit reicht etwa 60 Tagen Kleinkatzen 100 Tage Tigern. Regel korreliert Länge Tragzeit Körpergröße, wobei Verwandtschaftsgruppe Ozelot allerdings deutlich längere Tragzeit Kleinkatzen gleicher Größe. Arten deutlich kleinere Würfe gebären Regel zwei Jungtiere gegenüber drei vier Jungtieren Arten Verwandtschaft Hauskatze afrikanischer asiatischer Wildkatzen. Geparde fünf sechs Jungtieren vergleichsweise große Würfe. Weibchen wählen Bau Geburt Regel erst kurz Wurf. Regel handelt dabei versteckte Platz etwa Vertiefung Vegetation, Höhle Gebüsch Baumstamm. Jungtiere Geburt vergleichsweise klein, unbehaart blind kriechen, Mutter gelangen. Regel verbringt Mutter ersten 24 48 Stunden Jungtieren. ersten Wochen Geburt jagt Mutter Nähe Unterschlupfs lang notwendig. Hauptstillzeit, meist etwa zwei Monate lang, Katze etwa 2,5 drei Mal hohen Energiebedarf normal entsprechend mehr Beute. Jungtiere maximal 24 36 Stunden allein lassen kehrt häufig möglich Beute zurück. Dabei füttern Kleinkatzen Jungtiere ab etwa Monat zusätzlich Stillen Beute, größeren Katzen beginnen Jungtiere Aufnahme Fleisch Verlassen Baus etwa zwei Monaten. Dabei bekommen Jungtiere allerdings zusätzlich meist Monate Milch Mutter. etwa drei vier Monaten begleiten Jungtiere Mutter Jagd ersten eigenen Erfahrungen verbessern Jagdmethoden. Mortalität Jungtieren vergleichsweise hoch, ungeschützten Jungtiere Prädatoren leichte Beute darstellen. Untersuchungen Geparden Serengeti überleben etwa 4 8 % Jungtiere ersten 18 Monate Selbstständigkeit, bereits 70 % starben bereits Bau. Dabei wurden fast 75 % meisten Jungtiere Löwen Hyänen getötet, geringer Prozentsatz starb Krankheiten, Hunger Savannenfeuern. Tigern Sterberate Jungtiere 60 % geschätzt, Löwen 14 80 %. Gegenüber männlichen Artgenossen verhalten Muttertiere Jungenaufzucht aggressiv, Infantizid Raubkatzen, Löwen Großkatzen, Hauskatzen, häufig vorkommt. Sobald Jungtiere ausgewachsen allein jagen, verlassen Mutter Revier. Dabei verteilen Kleinkatzen meist etwa Jahr, Großkatzen zwei sogar drei Jahre dauern. Regel verlassen Männchen schneller Reviere Mutter siedeln entfernt, Weibchen bleiben länger Regel befinden Reviere Nähe Mutter. vielen Katzenarten kommt dagegen Weibchen Verteilung, Jungtiere übernehmen Teile Reviers Mutter, weiterhin beschützen, leben philopatrisch direkter Nachbarschaft. Dadurch bilden häufig Cluster benachbarten Revieren weiblicher Tiere enger familiärer Bindung.",
    "Stammesgeschichte": "Katzen stammen heute gängiger Meinung Vorfahren Schleichkatzen verwandten Formen Gruppe katzenartigen Raubtiere ab. Auftreten eigentlichen Katzen entwickelten innerhalb Kartezenartigen Nimraviden Scheinsäbelzahnkatzen ( Nimravidae ) Barbourofelidae, beide Katzen erinnern, heute eigene Familien gestellt. ältesten Katzen zugeordneten Fossilfunde etwa 30 Millionen Jahre alt stammen Oligozän, Proailurus erste bekannte Vertreter Felidae erschien. größer Hauskatze jagte tropischen Wäldern Europas. entwickelten etwa 20 Millionen Jahren zwei Äste, früher gemeinsam paraphyletischen Gattung Pseudaelurus zusammengefasst wurden heute getrennt betrachtet. Gattung Pseudaelurus verbliebenen Arten entwickelten Säbelzahnkatzen ( Machairodontinae ), deren letzte Vertreter Gattungen Homotherium Smilodon etwa 10.000 Jahren ausgestorben. Parallel Säbelzahnkatzen entwickelten mehrere weitere Gattungen Nordamerika verbreiteten Arten Gattung Hyperailurictis Europa Asien verbreiteten Gattungen Styriofelis Sivaelurus. Nachfahren Hyperailurictis Sivaelurus ausgestorben, entwickelten heutigen Katzen Klein- Großkatzen Schwestergruppe Styriofelis. heutigen Katzenarten gehen entsprechend gemeinsamen Vorfahren zurück, etwa 13 15 Millionen Jahren lebte. folgende Kladogramm stellt stammesgeschichtlichen Verwandtschaftsverhältnisse Katzen dar. folgt dabei Piras et al. 2013:",
    "Systematik": "unterscheidet etwa 45 Katzenarten, Körperbau relativ ähnlich äußerlich Färbung Größe variieren. Lediglich Gepard weicht diesbezüglich deutlich Katzen ab. weitgehend einheitliche Körperbau Katzen erschwerte Unterteilung Familie anhand morphologischen Kriterien. Anzahl Gattungen variiert Zeit verschiedenen Darstellungen, Mitte 20. Jahrhunderts wurden Katzen wenige, Extrem zwei drei, Gattungen aufgeteilt, derzeit zahlreichen Überarbeitungen Berücksichtigung morphologischer genetischer Merkmale 13 14 Gattungen anerkannt. letzten Jahren wurden neue Arten beschrieben, deren Artstatus molekularbiologische Analysen identifiziert bestätigt wurde.",
    "Traditionelle Systematik": "Traditionell wurden drei lebende Unterfamilien, Großkatzen, Kleinkatzen Geparde unterschieden. Gepard stand eigene Unterfamilie Geparde ( Acinonychinae ) abseits; Gattungen Panthera ( Löwe, Jaguar, Leopard, Tiger Schneeleopard ) Nebelparder bildeten Großkatzen ( Pantherinae ), übrigen Arten Kleinkatzen ( Felinae ) zusammengefasst wurden. weitere Unterfamilie, heute ausgestorben, stellen Säbelzahnkatzen dar. Systematik beruhte Collier O ’ Brien ( A molecular phylogeny of the Felidae: immunological distance, 1985 ) lange Zeit allgemeine Lehrmeinung. wichtiges Unterscheidungskriterium Unterteilung diente einerseits Morphologie Krallen, Geparden einziehbar, andererseits Aufbau Zungenbeins, Großkatzen elastisch, Kleinkatzen verknöchert. Unterschied führte Fähigkeit brüllen beziehungsweise schnurren zurück. Großkatzen ( Löwe, Tiger, Leopard, Jaguar ) Gegensatz Kleinkatzen brüllen. Schnurren Katzen, Großkatzen jedoch beim Ausatmen, Kleinkatzen sowohl beim Ein- beim Ausatmen. Mittlerweile herausgestellt, Fähigkeit brüllen Zungenbein abhängt, Aufbau Kehlkopfes zusammenhängt.",
    "Moderne Systematiken": "Entwicklung molekulargenetischen computergestützten Methoden, deren Hilfe DNA- Proteinsequenzen verglichen, wurde erkannt, herkömmliche Dreiteilung Katzen tatsächlichen Verwandtschaftsverhältnisse widerspiegelt. Monophylie ( Untergruppen entstammen Stammform ) Katzen gibt Zweifel. stellte etwa heraus, Geparde eigene Unterfamilie bilden, eng Pumas verwandt Kleinkatzen zählen. Basis morphologischen Ähnlichkeiten angenommene nahe Verwandtschaft Karakal Luchsen wurde revidiert. Zugehörigkeit fossilen Säbelzahnkatzen Katzen konnte molekularbiologisch bestätigt.",
    "Gattungen und Arten": "Analysen zufolge unterteilen rezenten Katzenarten acht Hauptlinien, vermutlich aufgelisteten Reihenfolge Hauptzweig abspalteten. erste Abspaltung, Großkatzen, erfolgte wahrscheinlich etwa 10,8 Millionen Jahren, jüngste, Aufspaltung Hauskatzen-Linie Bengalkatzen-Linie, wohl etwa 6,2 Millionen Jahren stattfand. Relativ unsicher Zugehörigkeit Bergkatze Ozelot-Linie. gibt jedoch weitere Linien, deren Zuordnung schwierig unterschiedlichen Untersuchungen variiert. gehört Manul, Zuordnung Publikationen Verwandtschaft innerhalb Echten Katzen liegt, Marmorkatze, teilweise Großkatzen eingeordnet. Zudem innerhalb gut erforschten Gruppe Katzen immer neue Arten beschrieben, bekannten Arten abgespalten, zuletzt etwa innerhalb Pardelkatzen Aufsplittung Nebelparders zwei Arten.",
    "Bedrohung und Schutz": "Fast Katzenarten Bestand gefährdet. Neben Verlust Lebensraum leiden Populationen Bejagung Pelzhandel Traditionelle chinesische Medizin wegen Konflikten Nutztierhaltung.",
    "Pelztierjagd und -handel": "kommerzielle Bejagung Katzen aufgrund Pelze begann 17. Jahrhundert organisierten Jagd Kanadische Luchse Nordamerika verstärkte 19. Jahrhundert, gefleckte gestreifte Katzenfelle tropischen Regionen Pelze Bekleidungsindustrie Dekoration populär wurden. Mitte 20. Jahrhunderts führte massiven Rückgang Populationen meisten betroffenen Katzenarten. späten 1960er Jahren wurden jährlich 10.000 Leoparden, 15.000 Jaguar-, 5.000 Geparden- 200.000 Ozelotfelle Marktwert mehr 30 Millionen US-Dollar Vereinigten Staaten importiert. späten 1970ern wurden global mehr halbe Million Katzenfelle gehandelt, 1979 stieg Anzahl etwa 700.000 Felle, wobei nationalen Handelsmengen Zahlen erfasst wurden. Rückgang Großkatzen ersten Handels- Fangverboten Pelzwirtschaft Jahrzehnten konzentrierten Jäger mehr mehr kleineren Katzenarten etwa Kleinfleckkatze, allein 145.000 Pelze Jahr 1980 gehandelt wurden. Bengalkatze steigerten Handelsmengen 1987 mehr 200.000 Pelze heute China großen Anzahlen etwa 100.000 Tieren pro Jahr gejagt gehandelt. 1970er 1980er Jahren wurden national international vermehrt Artenschutzprogramme aufgelegt Handlsvereinbahrungen getroffen. 1975 trat Washingtoner Artenschutzübereinkommen größte Programme Kraft, heute internationalen Handel gefährdeten Arten freilebender Tiere Pflanzen regelt. Seitdem wurden Jagd, Handel Nutzung Produkten gefährdeter Tierarten international weitgehend verboten meisten Katzenarten dürfen kontrolliert gar mehr legal gejagt; Katzenarten Ausnahme Hauskatze Listen geschützten Arten verzeichnet. Jagd Kanadischen Luchs Rotluchs Nordamerika erlaubt, jedoch streng reguliert. Trotzdem gibt Regionen, denen Populationen stabilisieren konnten denen heute mehr Tiere getötet ökologisch vertretbar. 1990ern gingen Handelszahlen etwa Viertel gegenüber 1980ern zurück Katzenpelzmarkt 2000ern dominiert Fellen Bengalkatze China, beiden nordamerikanischen Luchsarten sowie Eurasischen Luchs Russland ( Stand 2009 ). gesteigerten Bewusstsein ökologisches Handeln Bevölkerung Industrieländer geht Bedarf zurück, Tragen Pelz größten Teil Bevölkerung Nordamerika Europa mehr vertretbar verurteilt.",
    "Großwildjagd": "Neben Jagd Katzen Pelztiere spielte seit 19. Jahrhundert 20. Jahrhundert Jagd Großkatzen Trophäen Kontext Großwildjagd zentrale Rolle. Jagdtrophäen wurden präparierte Tiere, deren Köpfe, Schädel Felle Jagdbeute, bereits Pelzen, Statussymbol präsentiert. Afrika galten Löwen Leoparden Teil Big Five, Asien Tiger beliebte Jagdbeute Amerika ging neben Bärenjagd Puma- Jaguarjagd. Philosophie Großwildjagd lag darin, möglichst große gefährliche Tiere erlegen eigene Macht Jäger demonstrieren. Art Jagd existiert heute dabei Regel streng reguliert. Dabei Jäger Bezahlung gezielt Führern entsprechenden Beutetieren geleitet erlaubt, einzelne besonders auffällige attraktive Tiere töten. dadurch erwirtschafteten Einnahmen kommen Idealfall Arten- Naturschutzprojekten zugute, sodass Entnahme Einzeltieren darüber gerechtfertigt. Praxis etabliert, jedoch kontrovers diskutiert erfordert strenges Monitoring entsprechende Regulierungen.",
    "Hybridisierung mit der Hauskatze": "Europäischen Wildkatze, jedoch Arten, stellt Hybridisierung Hauskatzen zentrales Problem Schutzes dar. Obwohl wahrscheinlich seit Einführung Hauskatze Europa regelmäßig Kreuzungen Haus- Wildkatzen kam, stellt starken Rückgang Wildkatzenpopulationen immer steigenden Anzahlen verwilderten Hauskatzen Verbreitungsgebieten letzten 200 Jahren zunehmendes Problem dar. Teilen Verbreitungsgebietes wurden Bestände Europäischen Wildkatze seit 19. Jahrhundert Jagd Rückgang Waldgebieten stark dezimiert teilweise regional ausgerottet. Naturschutzmaßnahmen Regulierung Jagd kam lokal Wiederansiedlungen Wildkatze, Gebieten konnten Wildkatzen verbreiten. Gut dokumentiert Schottland, Wildkatzenpopulationen organisierte Jagd Ersten Weltkrieg nahezu vollständig ausgerottet, zugleich ging Waldbestand etwa 4 % Landfläche zurück. Ersten Weltkrieg wurde Jagd stärker reguliert Wildkatze breitete stärker, dabei besiedelte größten Teil Zentral- Nordschottlands. männlichen Tiere stärker ausbreiteten, kamen Regionen, denen weiblichen Wildkatzen gab, verpaarten vermehrt Hauskatzen. Hauskatzenhybriden nahmen gesamten Verbreitungsgebiet genetischen Merkmale verbreiteten zunehmend gesamte Wildkatzenpopullation Schottlands; kaum feststellbar, wildlebende Katzen Wildkatzen. Regionen, denen Wildkatzenpopulation weitgehend stabil geblieben, treten Effekte trotz gelegentlicher Hybridisierung, etwa italienischen Wildkatzenpopulationen.",
    "Konflikte mit der Nutztierhaltung": "Viele Katzenarten, Nähe menschlichen Ansiedlungen leben, erbeuten regelmäßig Haus- Nutztiere. dringen kleine Katzenarten Ställe Freilandgehege, Hühner Geflügel erbeuten, größere Katzen jagen Schafe, Ziegen, Rinder Pferde, Gelegenheit. Menschen betrachten Raubtiere entsprechend Schädlinge stellen Giftködern, Fallen aktiv jagend. Häufig handelt dabei Katzen, verletzt Gründen Lage, Wildtiere erbeuten entsprechend leichte Beute vorziehen. Alternativ Tiere Regionen, denen natürliche Bestand Beutetieren stark reduziert entsprechend Alternativen, ausreichend Nahrung kommen. Nachgewiesen etwa Jaguaren, ebenso Beutetiere aufgrund Abholzungen Lebensraum mehr mehr landwirtschaftlich genutzte Gebiete abwandern, denen einfacher jagen. Folge Beutetiere stärker bejagt Regel freilaufenden Nutztiere einfacher häufiger verfügbaren Beute Katzen. Übertragbar Studien Regionen etwa Asien Afrika, Schneeleoparden, Leoparden Tiger Nutztiere erbeuten. Wildtiermanagement verschiedenen Methoden versucht, Konflikte reduzieren Großkatzen davon abzuhalten, Nutztiere reißen. Verbesserung Herden- Nutztierschutzes Raubkatzen effektiv abgehalten, Nutztiere erbeuten Anzahl erbeuteten Nutztiere geht Verbesserung Schutzmaßnahmen deutlich zurück. Zugleich bewirkt Reduzierung Jagd Schutz Beutetieren, Raubkatzen genug natürliche Beutetiere Verfügung Nutztiere ausweichen."
}