{
    "Entwicklungsgeschichte": "Sprache wurde Anfang 1990er Jahre Guido van Rossum Centrum Wiskunde & Informatica Amsterdam Nachfolger Programmier-Lehrsprache ABC entwickelt ursprünglich verteilte Betriebssystem Amoeba gedacht. Name geht, Logo vermuten lässt, gleichnamige Schlangengattung Python zurück, bezog ursprünglich englische Komikergruppe Monty Python. Dokumentation finden daher Anspielungen Sketche Flying Circus. Trotzdem etablierte Assoziation Schlange, Programmiersprache Cobra sowie Python-Toolkit „ Boa “ äußert. erste Vollversion erschien Januar 1994 Bezeichnung Python 1.0. Gegenüber früheren Versionen wurden Konzepte funktionalen Programmierung implementiert, allerdings später aufgegeben wurden. 1995 2000 erschienen neue Versionen, fortlaufend Python 1.1, 1.2 etc. bezeichnet wurden. Python 2.0 erschien 16. Oktober 2000. Neue Funktionen umfassten voll funktionsfähige Garbage Collection ( automatische Speicherbereinigung ) Unterstützung Unicode-Zeichensatz. Python 3.0 ( Python 3000 ) erschien 3. Dezember 2008 längerer Entwicklungszeit. beinhaltete tiefgreifende Änderungen Sprache, etwa Entfernen Redundanzen Befehlssätzen veralteten Konstrukten. Python 3.0 hierdurch teilweise inkompatibel früheren Versionen wurde, beschloss Python Software Foundation, Python 2.7 parallel Python 3 Ende 2019 neuen Versionen unterstützen ( Hinweise letzten 2er-Version, Support-Ende Migration siehe Abschnitt Ende Python 2 ).",
    "Ziele": "Python wurde Ziel größter Einfachheit Übersichtlichkeit entworfen. zwei Maßnahmen erreicht. kommt Sprache relativ wenigen Schlüsselwörtern. Syntax reduziert Übersichtlichkeit optimiert. Dadurch lassen Python-basierte Skripte deutlich knapper formulieren Sprachen. Van Rossum legte Entwicklung großen Wert Standardbibliothek, überschaubar leicht erweiterbar. Ergebnis schlechten Erfahrung Sprache ABC, Gegenteil Fall. Konzept ermöglicht, Python Module aufzurufen, Programmiersprachen geschrieben wurden, etwa Schwächen Python auszugleichen. Beispielsweise zeitkritische Teile maschinennäheren Sprachen C implementierte Routinen aufgerufen. Umgekehrt lassen Python Module Plug-ins Programme schreiben, entsprechende Unterstützung bieten. Blender, Cinema 4D, GIMP, Maya, OpenOffice bzw. LibreOffice, PyMOL, SPSS, QGIS KiCad Fall. Python Multiparadigmensprache. bedeutet, Python zwingt Programmierer einzigen Programmierstil, erlaubt, jeweilige Aufgabe besten geeignete Paradigma wählen. Objektorientierte strukturierte Programmierung vollständig unterstützt, funktionale aspektorientierte Programmierung einzelne Elemente Sprache unterstützt. Freigabe mehr benutzter Speicherbereiche erfolgt Referenzzählung. Datentypen dynamisch verwaltet, automatische statische Typprüfung z. B. C++ gibt. Jedoch unterstützt Python ab Version 3.5 optionale Typ-Annotationen, statische Typprüfung mithilfe externer Software, Beispiel Mypy, vereinfachen.",
    "Datentypen und Strukturen": "Python besitzt größere Anzahl grundlegenden Datentypen. Neben herkömmlichen Arithmetik unterstützt transparent beliebig große Ganzzahlen komplexe Zahlen. üblichen Zeichenkettenoperationen unterstützt. Zeichenketten Python allerdings unveränderliche Objekte ( Java ). Daher geben Operationen, Zeichenkette verändern sollen – z. B. Ersetzen Zeichen – immer neue Zeichenkette zurück. Python Objekt: Klassen, Typen, Methoden, Module etc. Datentyp jeweils Objekt ( Wert ) gebunden Variable, d. h. Datentypen dynamisch vergeben, Smalltalk Lisp – Java. Trotz dynamischen Typverwaltung enthält Python gewisse Typprüfung. strenger Perl, weniger strikt etwa Objective CAML. Implizite Umwandlungen Duck-Typing-Prinzip numerische Typen definiert, sodass beispielsweise komplexe Zahl langen Ganzzahl explizite Typumwandlung multiplizieren. Format-Operator % gibt implizite Umwandlung Objekts Zeichenkette. Operator == überprüft zwei Objekte ( Wert- ) Gleichheit. Operator is überprüft tatsächliche Identität zweier Objekte.",
    "Sammeltypen": "Python besitzt mehrere Sammeltypen, darunter Listen, Tupel, Mengen ( Sets ) assoziative Arrays ( Dictionaries ). Listen, Tupel Zeichenketten Folgen ( Sequenzen, Felder ) kennen fast gleichen Methoden: Zeichen Kette ebenso iterieren Elemente Liste. Außerdem gibt unveränderlichen Objekte, Erzeugung mehr geändert. Listen z. B. erweiterbare Felder, wohingegen Tupel Zeichenketten feste Länge unveränderlich. Zweck Unveränderlichkeit hängt z. B. Dictionaries zusammen, Datentyp, assoziatives Array bezeichnet. Datenkonsistenz sichern, müssen Schlüssel Dictionary Typ „ unveränderlich “. Dictionary eingetragenen Werte dagegen beliebigem Typ. Sets Mengen Objekten CPython ab Version 2.4 Standardsprachumfang enthalten. Datenstruktur beliebige ( paarweise unterschiedliche ) Objekte aufnehmen stellt Mengenoperationen beispielsweise Durchschnitt, Differenz Vereinigung Verfügung.",
    "Objektsystem": "Typsystem Python Klassensystem abgestimmt. Obwohl eingebauten Datentypen genau genommen Klassen, Klassen Typ erben. Eigenschaften Zeichenketten Wörterbüchern erweitern – Ganzzahlen. Python unterstützt Mehrfachvererbung. Sprache unterstützt direkt Umgang Typen Klassen. Typen ausgelesen ( ermittelt ) verglichen verhalten Objekte – tatsächlich Typen ( Smalltalk ) Objekt. Attribute Objektes Wörterbuch extrahiert.",
    "Syntax": "Entwurfsziele Python gute Lesbarkeit Quellcodes. Anweisungen benutzen häufig englische Schlüsselwörter, Sprachen Symbole einsetzen ( z. B. or statt || ). strukturierte Programmierung besitzt Python folgenden Elemente: Schleifen ( wiederholte Ausführung ): for … else Iteration Elemente Sequenz while … else Wiederholung, solange Ausdruck Boolean-Wert True Verzweigungen ( bedingte Ausführung ): if … elif … else bedingte Verzweigungen match … case … if strukturiertes Pattern Matching Exceptions ( Ausführung Fehlerfall ): try … except … else … finally Ausnahmebehandlungen with Ausführen Blocks Kontext-Manager Gegensatz vielen Sprachen for- while-Schleifen else-Zweig. ausgeführt, Schleife vollständig durchlaufen mittels break, return Ausnahme abgebrochen wurde.",
    "Strukturierung durch Einrücken": "Python benutzt Miranda Haskell Einrückungen Strukturierungselement. Idee wurde erstmals Peter J. Landin vorgeschlagen off-side rule ( „ Abseitsregel “ ) genannt. meisten Programmiersprachen Blöcke Klammern Schlüsselwörter markiert, unterschiedlich große Leerräume außerhalb Zeichenketten spezielle Semantik tragen. Laut van Rossum verhindert Einrückung Teil Sprachsyntax Missverständnisse Programmierers, spart Raum Vergleich Einrückungskonventionen, Klammern eigene Zeile setzen setzt Stil-Diskussionen Ende. Hierzu Beispiel Berechnung Fakultät Ganzzahl, C Python: Fakultätsfunktion C: gleiche Funktion Python: jedoch darauf achten, Einrückungen gesamten Programmtext gleich gestalten. gemischte Verwendung Leerzeichen Tabulatorzeichen Problemen führen, Python-Interpreter Tabulatoren Abstand acht Leerzeichen annimmt. Je Konfiguration Editors Tabulatoren optisch weniger acht Leerzeichen dargestellt, Syntaxfehlern ungewollter Programmstrukturierung führen. vorbeugende Maßnahme Editor Tabulatorzeichen feste Anzahl Leerzeichen ersetzen lassen. Python-Distribution enthält Standardbibliothek Modul tabnanny, Vermischung Tabulator- Leerzeichen erkennen beheben hilft. Fakultätsfunktion C einzeilig ternärem Operator formulieren: Fakultätsfunktion C: Fakultätsfunktion Python:",
    "Funktionales Programmieren": "Coconut Erweiterungen erleichtern funktionale Programmieren Python. Darüber hinaus lässt herkömmlichen Python realisieren: Ausdrucksstarke syntaktische Elemente funktionalen Programmierung vereinfachen Arbeiten Listen Sammeltypen. Vereinfachung Listennotation, funktionalen Programmiersprache Haskell stammt; Berechnung ersten fünf Zweierpotenzen: Python Funktionen Argumente auftreten dürfen, ausgeklügeltere Konstruktionen ausdrücken, Continuation-Passing Style. Pythons Schlüsselwort lambda Anhänger funktionalen Programmierung fehlleiten. lambda-Blöcke Python Ausdrücke enthalten, Anweisungen. Anweisungen generell verwendet, Funktion zurückzugeben. übliche Vorgehensweise stattdessen, Namen lokalen Funktion zurückzugeben. folgende Beispiel zeigt anhand einfachen Funktion Ideen Haskell Brooks Curry: Currying einfache Art möglich, generische Funktionsobjekte problemspezifische herunterzubrechen. einfaches Beispiel: curry-Funktion aufgerufen, erwartet Funktion zwei notwendigen Parametern sowie Parameterbelegung zweiten Parameter Funktion. Rückgabewert curry Funktion, Gleiche tut func, Parameter benötigt. Closures o. g. Mechanismen Python ebenfalls einfach möglich. simples Beispiel Stack, intern Liste repräsentiert: Weise erhält drei Funktionsobjekte pop, push, is_empty, Stack modifizieren bzw. enthaltene Elemente prüfen, dabei l direkt zuzugreifen.",
    "Ausnahmebehandlung": "Python nutzt ausgiebig Ausnahmebehandlung ( englisch exception handling ) Mittel, Fehlerbedingungen testen. weit Python integriert, teilweise sogar möglich, Syntaxfehler abzufangen Laufzeit behandeln. Ausnahmen Vorteile gegenüber beim Programmieren üblichen Verfahren Fehlerbehandlung ( z. B. Fehler-Rückgabewerte globale Statusvariablen ). Thread-sicher leicht höchste Programmebene weitergegeben beliebigen Ebene Funktionsaufruffolge behandelt. korrekte Einsatz Ausnahmebehandlungen beim Zugriff dynamische Ressourcen erleichtert zudem, bestimmte Race Conditions basierende Sicherheitslücken vermeiden, entstehen, Zugriffe bereits veralteten Statusabfragen basieren. Python-Ansatz legt Einsatz Ausnahmen nahe, wann immer Fehlerbedingung entstehen. Nützlich Prinzip beispielsweise Konstruktion robuster Eingabeaufforderungen: Programmstück fragt Benutzer lange Zahl, Zeichenfolge eingibt, per int ( ) Ganzzahl konvertieren lässt. Ausnahmebehandlung vermieden, Fehleingabe Laufzeitfehler führt, Programm Abbruch zwingt. Ebenso berücksichtigte Interrupt-Signal ( SIGINT, häufig Strg+C ) mittels Ausnahmebehandlung Python abgefangen behandelt ( except KeyboardInterrupt: … ).",
    "Standardbibliothek": "mächtige Standardbibliothek größten Stärken Python, wodurch viele Anwendungen eignet. überwiegende Teil davon plattformunabhängig, größere Python-Programme oft Unix, Windows, macOS Plattformen Änderung laufen. Module Standardbibliothek C Python geschriebenen Modulen ergänzt. Standardbibliothek besonders Internetanwendungen zugeschnitten, Unterstützung großen Anzahl Standardformaten -protokollen ( MIME HTTP ). Module Schaffung grafischer Benutzeroberflächen, Verbindung relationalen Datenbanken Manipulation regulärer Ausdrücke ebenfalls enthalten.",
    "Grafische Benutzeroberflächen (GUI)": "Hilfe mitgelieferten Moduls Tkinter Python ( Perl Tcl ) schnell grafische Benutzeroberfläche ( GUI ) Tk erzeugt. gibt darüber hinaus Vielzahl weiteren Wrappern Anbietern. stellen Anbindungen ( englisch language bindings ) GUI-Toolkits z. B. PyGTK, PyQt, wxPython, PyObjC PyFLTK Verfügung. Neben Tkinter Modul Zeichnen Turtle-Grafiken mitgeliefert.",
    "Beispiel": "triviales Beispiel sei kompakte Sortieralgorithmus Quicksort angegeben: ermöglicht insbesondere Listennotation Variablen links rechts kompakte Darstellung. Vergleich iterative Formulierung zwei Zeilen: Beispiel gesparte Schreibarbeit Listennotation. Tatsächlich Fall iterative Formulierung schnellere, pro Durchgang Feld „ liste “ iteriert zweimal Listennotation.",
    "Interaktive Benutzung": "Lisp, Ruby, Groovy Perl unterstützt Python-Interpreter interaktiven Modus, Ausdrücke Terminal eingegeben Ergebnisse sofort betrachtet. Neulinge angenehm, Sprache lernen, erfahrene Programmierer: Code-Stückchen interaktiv ausgiebig getestet, bevor geeignetes Programm aufnimmt. Darüber hinaus steht Python Shell Kommandozeileninterpreter verschiedene unixoide Computer-Betriebssysteme Verfügung, neben klassischen Unix-Shellkommandos direkte Eingaben Python-Form verarbeiten. IPython populäre interaktive Python-Shell stark erweiterter Funktionalität.",
    "Implementierungen": "Interpreter CPython offizielle Referenzimplementierung Programmiersprache Python deren Interpreter. Daneben gibt Java implementierten Python-Interpreter namens Jython, Bibliothek Java-Laufzeitumgebung Python verfügbar gemacht. Compiler Außer oben genannten Interpretern existieren Compiler, Python-Code Programmiersprache übersetzen. Cython Python-Code effiziente C-Erweiterungen übersetzt externer C++- C-Code angebunden. Ebenso existiert Compiler IronPython.Net-Framework- bzw. Mono-Plattform. Python Skriptsprache Programme C++ nutzen, zumeist Boost-Python-Bibliothek ( neueren Projekten ) Cython verwendet. Python-Parser Parrot Python geschriebener Just-in-time-Compiler Python, PyPy, EU gefördert wurde, ebenfalls Entwicklung. Python-Variante Pyston verwendet Just-in-time-Compilierung beschleunigt Ausführung Python-Programmen. Außerdem existiert Python-Interpreter Mikrocontroller namens MicroPython.",
    "Entwicklungsumgebung": "Neben IDLE, oft Python installiert hauptsächlich Textumgebung Shell besteht, wurden vollwertige Entwicklungsumgebungen ( IDEs ) Python entwickelt, beispielsweise Eric Python IDE, Spyder PyCharm. Weiterhin gibt Plug-ins größere IDEs Eclipse, Visual Studio, IntelliJ IDEA NetBeans. Texteditoren Programmierer Vim Emacs lassen Python anpassen: einfacher Python-Mode bereits integriert, komfortablere Erweiterungen hinzugefügt. verschiedenen GUI-Toolkits, z. B. Tkinter ( GUI-Builder ), WxPython ( wxGlade ), PyQt ( Qt Designer ), PySide, PyGTK ( Glade ), Kivy PyFLTK gibt teils eigene Editoren, denen grafische Benutzeroberflächen vergleichsweise einfache Art aufbauen lassen.",
    "Paketverwaltung": "Python unterstützt Erstellung Paketen; dabei helfen distutils setuptools. Pakete PyPI, Python Package Index, gespeichert Installation abgerufen. Paketmanager üblicherweise pip alten Systemen easy_install eingesetzt. Paketversionen Anaconda ( Python-Distribution ) Paketverwaltung conda verwaltet.",
    "Verbreitung und Einsatz": "Python meisten gängigen Betriebssysteme frei erhältlich meisten Linux-Distributionen Standardumfang enthalten. Python Webserver einzubinden, Webserver-umgreifend WSGI verwendet, Nachteile CGI umgeht. WSGI stellt universelle Schnittstelle Webserver Python ( -Framework ) Verfügung. Reihe Web-Application-Frameworks nutzt Python, darunter Django, Pylons, SQLAlchemy, TurboGears, web2py, Flask Zope. Ferner gibt Python-Interpreter Symbian-Betriebssystem, Python verschiedenen Mobiltelefonen verfügbar. Version 2.5.1 Python Bestandteil AmigaOS 4.0.",
    "Kommerzieller Einsatz": "Bekannte kommerzielle Projekte, etwa Google Suche YouTube, basieren Teilen Python. Spieleindustrie findet Sprache bisweilen Einsatz, etwa EVE Online, World Conflict Civilization IV.",
    "In der Lehre": "Python gern Lehre eingesetzt, Python Seite einsteigerfreundlich, Seite leistungsfähig mächtig genug, theoretische Grundlagen Programmierung vermitteln moderne Anwendungen komplexen Datenanalysen, grafischer Programmierung Datenbankanwendungen entwickeln. Lehrbücher, explizit junge Menschen Programmiererfahrung wenden, unterstützen unterstreichen Entwicklung. Rahmen Projektes 100-Dollar-Laptop Python Standardsprache Benutzeroberfläche verwendet. 100-Dollar-Rechner Schulausbildung Kindern konzipiert, Benutzung dafür gestalteten grafischen Benutzeroberfläche „ Sugar “ Knopfdruck gerade laufende Python-Quellcode angezeigt. Kindern Möglichkeit gegeben, dahinter liegende Informationstechnik real erleben Belieben „ Kulissen “ schauen. Einplatinen-Computer Raspberry Pi ( Python Interpreter ) ursprünglich ROM integrierten Python-Interpreter ausgeliefert. heute Python bevorzugtesten Sprachen Raspberry Pi. Standard-Betriebssystem Raspberry Pi OS kommt großen Python-Bibliothek Ansteuerung Hardware. Python weltweit Informatikausbildung Schulen Universitäten eingesetzt. steht inzwischen Reihe ( kostenlosen ) didaktisch konzipierten Online-Lernplattformen Python Schule Selbststudium ab 6. Schuljahr Verfügung – meist mehreren Sprachen. Online-Kurs Computer Science Circles z. B. Universität Waterloo Kanada bereitgestellt. deutsche Version betrieben deutschen Bundesweiten Informatikwettbewerben. TigerJython, gehostet Pädagogischen Hochschule Bern, Schweiz Informatikunterricht eingesetzt.",
    "In der Wissenschaft": "Wissenschaftsgemeinde genießt Python große Verbreitung, hauptsächlich wegen einfachen Einstiegs Programmierung großen Auswahl wissenschaftlicher Bibliotheken. Oft Python innerhalb Jupyter Notebooks genutzt. Numerische Rechnungen visuelle Aufbereitung Ergebnisse Graphen meist NumPy Matplotlib erledigt. Anaconda SciPy bündeln viele wissenschaftliche Python-Bibliotheken somit einfacher zugänglich. TensorFlow, Keras, Scikit-learn, PyTorch u. a. gibt große Bibliotheken Forschung Nutzung maschinellem Lernen Deep Learning ( Künstliche Intelligenz ).",
    "Ende von Python 2": "Unterstützung Python 2 beendet. letzte 2er-Version 2.7.18 20. April 2020; seit Datum Python 2 mehr unterstützt. gibt vielfältige umfangreiche Dokumentationen Umstieg Tools, Migration helfen ermöglichen, Code schreiben, Python 2 3 funktioniert.",
    "Kritik": "Definition Methoden Parameter self, Instanz entspricht, deren Methode aufgerufen, explizit Parameter angegeben. Andrew Kuchling, Autor langjähriger Python-Entwickler, unelegant objektorientiert empfunden. Python-Schöpfer van Rossum verweist hingegen darauf, nötig sei, bestimmte wichtige Konstrukte ermöglichen. Python-Grundsätze lautet zudem „ Explicit is better than implicit “. Version 3.0 wurde kritisiert, Methodendefinition Aufruf Basisklassenversion Methode explizite Angabe Klasse Instanz erfordert. wurde Verletzung DRY-Prinzips ( „ Don ’ t repeat yourself “ ) gesehen; außerdem behinderte Umbenennungen. Python 3.0 wurde Kritikpunkt behoben. Multiprozessor-Systemen behindert sogenannte Global Interpreter Lock ( GIL ) CPython Effizienz Python-Anwendungen, softwareseitiges Multithreading benutzen. Beschränkung existiert Jython IronPython. Bislang offizieller Seite geplant, GIL ersetzen, beginnend Version 3.13 mithilfe Flags deaktiviert. Alternativ empfohlen, mehrere miteinander kommunizierende Prozesse anstelle Threads verwenden. vorherrschenden Implementationen Ausführungsgeschwindigkeit niedriger vielen kompilierbaren Sprachen, ähnlich Perl, PHP, Dart Ruby. liegt Teil daran, Entwicklung CPython Klarheit Codes gegenüber Geschwindigkeit Vorrang eingeräumt. beruft dabei Autoritäten Donald Knuth Tony Hoare, verfrühter Optimierung abraten. Geschwindigkeitsprobleme auftreten, Optimierung Python-Codes gelöst, stattdessen JIT-Compiler PyPy verwendet zeitkritische Funktionen maschinennähere Sprachen C Cython ausgelagert."
}