{
    "Definition": "exact definition taxonomy varies source source, core discipline remains: conception, naming, classification groups organisms. points reference, recent definitions taxonomy presented: Theory practice grouping individuals species, arranging species larger groups, giving groups names, thus producing classification. field science ( major component systematics ) encompasses description, identification, nomenclature, classification science classification, biology arrangement organisms classification'' science classification applied living organisms, including study means formation species, etc.'' `` analysis organism's characteristics purpose classification'''' Systematics studies phylogeny provide pattern translated classification names inclusive field taxonomy'' ( listed desirable unusual definition ) varied definitions either place taxonomy sub-area systematics ( definition 2 ), invert relationship ( definition 6 ), appear consider two terms synonymous. disagreement whether biological nomenclature considered part taxonomy ( definitions 1 2 ), part systematics outside taxonomy. example, definition 6 paired following definition systematics places nomenclature outside taxonomy: Systematics: `` study identification, taxonomy, nomenclature organisms, including classification living things regard natural relationships study variation evolution taxa''. 1970, Michener et al. defined `` systematic biology'' `` taxonomy'' ( terms often confused used interchangeably ) relation one another follows: Systematic biology ( hereafter called simply systematics ) field ( ) provides scientific names organisms, ( b ) describes, ( c ) preserves collections, ( ) provides classifications organisms, keys identification, data distributions, ( e ) investigates evolutionary histories, ( f ) considers environmental adaptations. field long history recent years experienced notable renaissance, principally respect theoretical content. Part theoretical material evolutionary areas ( topics e f ), rest relates especially problem classification. Taxonomy part Systematics concerned topics ( ) ( ). whole set terms including taxonomy, systematic biology, systematics, scientific classification, biological classification, phylogenetics times overlapping meanings – sometimes, sometimes slightly different, always related intersecting. broadest meaning `` taxonomy'' used. term introduced 1813 de Candolle, Théorie élémentaire de la botanique. John Lindley provided early definition systematics 1830, although wrote `` systematic botany'' rather using term `` systematics''. Europeans tend use terms `` systematics'' `` biosystematics'' study biodiversity whole, whereas North Americans tend use `` taxonomy'' frequently. However, taxonomy, particular alpha taxonomy, specifically identification, description, naming ( i.e., nomenclature ) organisms, `` classification'' focuses placing organisms within hierarchical groups show relationships organisms.",
    "Monograph and taxonomic revision": "taxonomic revision taxonomic review novel analysis variation patterns particular taxon. analysis may executed basis combination various available kinds characters, morphological, anatomical, palynological, biochemical genetic. monograph complete revision revision comprehensive taxon information given particular time, entire world. ( partial ) revisions may restricted sense may use available character sets limited spatial scope. revision results conformation new insights relationships subtaxa within taxon study, may lead change classification subtaxa, identification new subtaxa, merger previous subtaxa.",
    "Taxonomic characters": "Taxonomic characters taxonomic attributes used provide evidence relationships ( phylogeny ) taxa inferred. Kinds taxonomic characters include:",
    "Alpha and beta taxonomy": "term `` alpha taxonomy'' primarily used refer discipline finding, describing, naming taxa, particularly species. earlier literature, term different meaning, referring morphological taxonomy, products research end 19th century. William Bertram Turrill introduced term `` alpha taxonomy'' series papers published 1935 1937 discussed philosophy possible future directions discipline taxonomy.... increasing desire amongst taxonomists consider problems wider viewpoints, investigate possibilities closer co-operation cytological, ecological genetics colleagues acknowledge revision expansion, perhaps drastic nature, aims methods, may desirable... Turrill ( 1935 ) suggested accepting older invaluable taxonomy, based structure, conveniently designated `` alpha'', possible glimpse far-distant taxonomy built upon wide basis morphological physiological facts possible, one `` place found observational experimental data relating, even indirectly, constitution, subdivision, origin, behaviour species taxonomic groups''. Ideals, may said, never completely realized., however, great value acting permanent stimulants,, even vague, ideal `` omega'' taxonomy may progress little way Greek alphabet. us please thinking groping `` beta'' taxonomy. Turrill thus explicitly excludes alpha taxonomy various areas study includes within taxonomy whole, ecology, physiology, genetics, cytology. excludes phylogenetic reconstruction alpha taxonomy. Later authors used term different sense, mean delimitation species ( subspecies taxa ranks ), using whatever investigative techniques available, including sophisticated computational laboratory techniques. Thus, Ernst Mayr 1968 defined `` beta taxonomy'' classification ranks higher species.An understanding biological meaning variation evolutionary origin groups related species even important second stage taxonomic activity, sorting species groups relatives ( `` taxa'' ) arrangement hierarchy higher categories. activity term classification denotes; also referred `` beta taxonomy''.",
    "Microtaxonomy and macrotaxonomy": "species defined particular group organisms gives rise practical theoretical problems referred species problem. scientific work deciding define species called microtaxonomy. extension, macrotaxonomy study groups higher taxonomic ranks subgenus, simply clades include one taxon considered species, expressed terms phylogenetic nomenclature.",
    "History": "descriptions taxonomic history attempt date taxonomy ancient civilizations, truly scientific attempt classify organisms occur 18th century, possible exception Aristotle, whose works hint taxonomy. Earlier works primarily descriptive focused plants useful agriculture medicine. number stages scientific thinking. Early taxonomy based arbitrary criteria, so-called `` artificial systems'', including Linnaeus's system sexual classification plants ( Linnaeus's 1735 classification animals entitled `` Systema Naturae'' ( `` System Nature'' ), implying, least, believed `` artificial system'' ). Later came systems based complete consideration characteristics taxa, referred `` natural systems'', de Jussieu ( 1789 ), de Candolle ( 1813 ) Bentham Hooker ( 1862–1863 ). classifications described empirical patterns pre-evolutionary thinking. publication Charles Darwin's Origin Species ( 1859 ) led new explanation classifications, based evolutionary relationships. concept phyletic systems, 1883 onwards. approach typified Eichler ( 1883 ) Engler ( 1886–1892 ). advent cladistic methodology 1970s led classifications based sole criterion monophyly, supported presence synapomorphies. Since, evidentiary basis expanded data molecular genetics part complements traditional morphology.",
    "Linnaean era": "Swedish botanist Carl Linnaeus ( 1707–1778 ) ushered new era taxonomy. major works Systema Naturae 1st Edition 1735, Species Plantarum 1753, Systema Naturae 10th Edition, revolutionized modern taxonomy. works implemented standardized binomial naming system animal plant species, proved elegant solution chaotic disorganized taxonomic literature. introduced standard class, order, genus, species, also made possible identify plants animals book, using smaller parts flower ( known Linnaean system ). Plant animal taxonomists regard Linnaeus' work `` starting point'' valid names ( 1753 1758 respectively ). Names published dates referred `` pre-Linnaean'', considered valid ( exception spiders published Svenska Spindlar ). Even taxonomic names published Linnaeus dates considered pre-Linnaean.",
    "The digital era of taxonomy": "Modern taxonomy heavily influenced technology DNA sequencing, bioinformatics, databases, imaging.",
    "Modern system of classification": "pattern groups nested within groups specified Linnaeus' classifications plants animals, patterns began represented dendrograms animal plant kingdoms toward end 18th century, well Charles Darwin's Origin Species published. pattern `` Natural System'' entail generating process, evolution, may implied, inspiring early transmutationist thinkers. Among early works exploring idea transmutation species Zoonomia 1796 Erasmus Darwin ( Charles Darwin's grandfather ), Jean-Baptiste Lamarck's Philosophie zoologique 1809. idea popularized Anglophone world speculative widely read Vestiges Natural History Creation, published anonymously Robert Chambers 1844. Darwin's theory, general acceptance quickly appeared classification reflect Darwinian principle common descent. Tree life representations became popular scientific works, known fossil groups incorporated. One first modern groups tied fossil ancestors birds. Using newly discovered fossils Archaeopteryx Hesperornis, Thomas Henry Huxley pronounced evolved dinosaurs, group formally named Richard Owen 1842. resulting description, dinosaurs `` giving rise'' `` ancestors'' birds, essential hallmark evolutionary taxonomic thinking. fossil groups found recognized late 19th early 20th centuries, palaeontologists worked understand history animals ages linking together known groups. modern evolutionary synthesis early 1940s, essentially modern understanding evolution major groups place. evolutionary taxonomy based Linnaean taxonomic ranks, two terms largely interchangeable modern use. cladistic method emerged since 1960s. 1958, Julian Huxley used term clade. Later, 1960, Cain Harrison introduced term cladistic. salient feature arranging taxa hierarchical evolutionary tree, desired objective named taxa monophyletic. taxon called monophyletic includes descendants ancestral form. Groups descendant groups removed termed paraphyletic, groups representing one branch tree life called polyphyletic. Monophyletic groups recognized diagnosed basis synapomorphies, shared derived character states. Cladistic classifications compatible traditional Linnean taxonomy Codes Zoological Botanical nomenclature, certain extent. alternative system nomenclature, International Code Phylogenetic Nomenclature PhyloCode proposed, regulates formal naming clades. Linnaean ranks optional formal standing PhyloCode, intended coexist current, rank-based codes. popularity phylogenetic nomenclature grown steadily last decades, remains seen whether majority systematists eventually adopt PhyloCode continue using current systems nomenclature employed ( modified, arguably much systematists wish ) 250 years.",
    "Kingdoms and domains": "Well Linnaeus, plants animals considered separate Kingdoms. Linnaeus used top rank, dividing physical world vegetable, animal mineral kingdoms. advances microscopy made classification microorganisms possible, number kingdoms increased, five- six-kingdom systems common. Domains relatively new grouping. First proposed 1977, Carl Woese's three-domain system generally accepted later. One main characteristic three-domain method separation Archaea Bacteria, previously grouped single kingdom Bacteria ( kingdom also sometimes called Monera ), Eukaryota organisms whose cells contain nucleus. small number scientists include sixth kingdom, Archaea, accept domain method. Thomas Cavalier-Smith, published extensively classification protists, 2002 proposed Neomura, clade groups together Archaea Eucarya, would evolved Bacteria, precisely Actinomycetota. 2004 classification treated archaeobacteria part subkingdom kingdom Bacteria, i.e., rejected three-domain system entirely. Stefan Luketa 2012 proposed five `` dominion'' system, adding Prionobiota ( acellular without nucleic acid ) Virusobiota ( acellular nucleic acid ) traditional three domains.",
    "Recent comprehensive classifications": "Partial classifications exist many individual groups organisms revised replaced new information becomes available; however, comprehensive, published treatments life rarer; recent examples Adl et al., 2012 2019, covers eukaryotes emphasis protists, Ruggiero et al., 2015, covering eukaryotes prokaryotes rank Order, although exclude fossil representatives. separate compilation ( Ruggiero, 2014 ) covers extant taxa rank Family., database-driven treatments include Encyclopedia Life, Global Biodiversity Information Facility, NCBI taxonomy database, Interim Register Marine Nonmarine Genera, Open Tree Life, Catalogue Life. Paleobiology Database resource fossils.",
    "Application": "Biological taxonomy sub-discipline biology, generally practiced biologists known `` taxonomists'', though enthusiastic naturalists also frequently involved publication new taxa. taxonomy aims describe organize life, work conducted taxonomists essential study biodiversity resulting field conservation biology.",
    "Classifying organisms": "Biological classification critical component taxonomic process. result, informs user relatives taxon hypothesized. Biological classification uses taxonomic ranks, including among others ( order inclusive least inclusive ): domain, kingdom, phylum, class, order, family, genus, species, strain.",
    "Taxonomic descriptions": "`` definition'' taxon encapsulated description diagnosis combined. set rules governing definition taxa, naming publication new taxa governed sets rules. zoology, nomenclature commonly used ranks ( superfamily subspecies ), regulated International Code Zoological Nomenclature ( ICZN Code ). fields phycology, mycology, botany, naming taxa governed International Code Nomenclature algae, fungi, plants ( ICN ). initial description taxon involves five main requirements: taxon must given name based 26 letters Latin alphabet ( binomial new species, uninomial ranks ). name must unique ( i.e. homonym ). description must based least one name-bearing type specimen. include statements appropriate attributes either describe ( define ) taxon differentiate taxa ( diagnosis, ICZN Code, Article 13.1.1, ICN, Article 38, may may based morphology ). codes deliberately separate defining content taxon ( circumscription ) defining name. first four requirements must published work obtainable numerous identical copies, permanent scientific record. However, often much information included, like geographic range taxon, ecological notes, chemistry, behavior, etc. researchers arrive taxa varies: depending available data, resources, methods vary simple quantitative qualitative comparisons striking features, elaborate computer analyses large amounts DNA sequence data.",
    "Author citation": "`` authority'' may placed scientific name. authority name scientist scientists first validly published name. example, 1758, Linnaeus gave Asian elephant scientific name Elephas maximus, name sometimes written `` Elephas maximus Linnaeus, 1758''. names authors often abbreviated: abbreviation L., Linnaeus, commonly used. botany,, fact, regulated list standard abbreviations ( see list botanists author abbreviation ). system assigning authorities differs slightly botany zoology. However, standard genus species changed since original description, original authority's name placed parentheses.",
    "Phenetics": "phenetics, also known taximetrics, numerical taxonomy, organisms classified based overall similarity, regardless phylogeny evolutionary relationships. results measure hypergeometric `` distance'' taxa. Phenetic methods become relatively rare modern times, largely superseded cladistic analyses, phenetic methods distinguish shared ancestral ( plesiomorphic ) traits shared derived ( apomorphic ) traits. However, certain phenetic methods, neighbor joining, persisted, rapid estimators relationships advanced methods ( Bayesian inference ) computationally expensive.",
    "Databases": "Modern taxonomy uses database technologies search catalogue classifications documentation. commonly used database, comprehensive databases Catalogue Life, attempts list every documented species. catalogue listed 1.64 million species kingdoms April 2016, claiming coverage three-quarters estimated species known modern science."
}