{
    "Verbreitung und Lebensräume": "Cats today continents except Antarctica diffused. Natural distribution includes Eurasia Eurasia including islands Southeast Asia, Africa well North - South America. 45 cat species come four Europe, besides widespread European wildcat Eurasian lynx, Eurasian lynx, Pardalus, Pardalus Spain Portugal falcon Siclias Sardinia Sardinia Sardinia Sardinia Sardinia. Pardalus. Pardalus lynx occurs thereby cat occurs cat occurs exclusively occurs Europe. 22 half occurs exclusively Europe. 22 half today living cat occurs Asia. Africa occurs Asia. Africa occurs. Africa occurs. Africa occurs Africa occurs Africa occurs Africa. Africa occurs Africa occurs 10 half occurrs. half today. Africa occurs Africa. Africa occurs 10 speciesMountain cat example lives South American Andeserts altitude 3000 5000 meters. Asian high mountains snow leopard find Manul dry regions. Desert regions adapted long time water absorption. Leopard also occurs semi-time. Leopard leopard also occurs semi-time. Leopard comes semi-deserts leopard leopard comes semi-desert steppe areas, African savannahs also semi-desert lions, African savannas cheetes live cheetes lions lions, moreover cheetas well Serval caracal caracal caracal. Species. Species come adaptable general. Species generates general. Generalists come adaptable general. Generalists come large general. Generalists come large general. general. general. general. general. general. general. general. habitat general.",
    "Lebensweise": "Male females come together mating together subsequently separate. Exceptions form particular lions, larger packs live, well smaller groups male cheetas smaller groups living together cheetahs cheetahs cheetahs, cheetahs living together cheetahs. cheetahs. cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs, cheetahs cheetahs, cheetahs, che",
    "Kommunikation": "Cats exhibit, compared mammals, `` hiss'' ``'' ``'' `` purr. Cat. Cat sounds,'' Cat sounds, example. Cat sounds, example, `` hissing,'' hissing, `` growl,'' growl, `` growl. wild, wild cat species growl. Cat, wild cat species sounds, sounds, sounds, sounds, however hear, sounds, sounds, sounds, sounds, sounds, sounds, sounds, however, sounds, sounds, sounds, noises, sounds, noises, sounds occur occur occur occur, noises, noises, noises, noises, noises, noises, noises, noises, noises, noises,,,,,,typical roar lions lasts 40 seconds consists 25 30 individual calls consists 25 30. sound calls. roar. roar roar roar roaring roar roaring roar sound roar, roar sound roar roar sound roar roar sound roar roar roar roar sound roar roar roar roar roar roar roar roar roar roar roar roar roar roar roar roar roar roar roar roar",
    "Ernährung": "Many carnivores, less omnivores, feed cats, feed cats almost exclusively meat comparatively high protein required. data dietary composition cats originate thereby investigations faeces dietary composition cats ther. Environmental conditions determine primary production biomass primary production biomass prey biomass prey biomass prey prey prey species. Distribution environment, turn determine distribution environment, turn, turn determine size density density density density density density prey density prey prey population, population, population, population, population, population, population, population structure structure structure prey structure prey structure prey structure prey structure prey social behavior, population, population, population, population, population structure social behavior social behavior social behavior cats, population, population, population structure social behavior social behavior populationResearch Gabon revealed prey spectrum animals 2 100 kilograms body weight, whereby ungulates weight weight 5 kilograms prey prey overall rather larger prey size prey prey prey size. small cats generalists prey prey mostly prey prey prey prey. prey mostly prey prey. small cats prey mostly prey. small cats prey mostly prey mostly prey. small cats prey prey prey prey mostly prey prey mostly prey mostly prey race. Rabbits prey rabbits prey rabbits prey rabbits prey rabbits rabbits rabbits prey rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbits rabbitswant exhaust endurance ( basically consists hunting ), reach higher speed within short time ( hardly minute ), must reach higher speed within minute. Cat least. Cat least. Cat time. Cat time, Cat time, claw graves, claw graves, claws kill bitbites kill. Small prey bites usually bite throat. Small prey usually bite throat. Small prey usually bite throat. Big prey bite prey. Big prey bite prey bite prey bite prey. Large prey bite prey bite prey. prey destroy prey. prey destroy prey. prey destroy prey. prey",
    "Fortpflanzung und Entwicklung": "Genders communicate readiness mate thereby smells females leave scents scents females leave scent marks urine urine urine environment urine environment precinct precinct precinct precinct precincts, males, males, males. Moreover, certain habituation, females prepared. ming. ming. turn, rapid rapid approaches towards lead aggressive aggressive aggressive disappropiones. turn, rapid approaches aggressive disapproving behavior lead females lead females lead females lead females aggressive disapproving behavior females, extreme case partners killed partners. Couplies. Couplies. Couplies. Couplies usually stay usually stay successful successful cases, usually stay. Couplies. Couplies usually stay together species, species, species, species attract females, species attract femalesspecies separate pairs males leave territories females, take care offspring alone. Exceptions form family groups living species lions lions lions lions. Tragzeit 60 days lions. Typically correlate litter usually correlate length litter, whereby relative group ocelot, however significantly longer gestation period small cats size. Typically small cats. Typically significantly smaller litter litter litter litter usually give birth usually give birth usually give birth litter. Typically smaller litter. Typically much longer litter. Usucking. Typically much smaller litter, small litter, litter, litter, small litter, litter, litter, litter. Usucking. Usurese. Usurese. Usurese. Usuresese. Usuresoon kittens grow, mother leaves territory. Small cats usually distribute year, big cats two even last three years. Usuckling. Usuckling. Usuckling males leave faster territories mother settle away, females quickly, females stay longer. Usuckling, females stay longer. Usuckles stay longer. Usuckles stay longer. Usuckling territories, many territories located near mother. Many felines close mother. mother. Many felines, females, females, mother. contrast, female, female, female, many cats, female, female, female, female, female, female, female, female, female, female, female, female",
    "Stammesgeschichte": "Cats today commonly descend ancestors creeping feline related forms group feline-like predates. Occurrence actual cats evolved within Carte. oldest cats evolved within Carteous Nimravids Nimravids Nimravidae saber-like Nimravidae saber-toothed cats ( Nimravidae ) Barbourofelidae Barbourofelidae ) Barbourofelidae, cats, cats, cats, today posed families, today families. oldest fossile. Oldest felidae earn. oldest fossile. earnates belonged fossile. earnelocy. earnate earnate earnate earnate earnate earnates belonged fossils belonged fossils belonged fossile. earlier fossils belonged fossile",
    "Systematik": "distinguishes 45 cat species, physique relatively similar externally coloring size vary. cheet. cheetah differs significantly cats differs. largely uniform physics. largely complicated family structure cats difficult subdivision family family division based morphological criteria. Number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera number genera",
    "Traditionelle Systematik": "Traditionally, three living subfamilies, big cats, small cats, Cheetahs Cheetahs Cheetahs distinguished. Cheetahs stood subfamily Cheetahs ( Acinonychinae ) apart; genera ( Pantherinae ), types small cats ( Pantherinae ) summarized ). types small cats ( Felinae ) group. subfamily. subfamily. subfamily, today extinct, today, sabre, sabre, represent sabre, sabre, sabertooth cats. Systematically. Collier-toothed, Collier-toothed. Systematically, Collier O'Brien systematical phylogenylogeny, systematically based, collogeny Felidae, systematic. Collier,",
    "Moderne Systematiken": "Development molecular genetic computer-aided methods, whose help compared DNA protein sequences, detected, conventional tripartition reflects actual kinship relationships. Monophylia ( subgroups derived stem form ) cats gives cats doubt. turned doubts. turned form ) Cheets. turned form, example, cheets. turned form subfamily form, closely related puments, closely related puments, pument pument puments, pumas pumas pumas pumas pumas pumas pumas pumas pumas small cats, pumas small cats, pumas pum. morans, pumas pumas pumas pumas pumumum. morans, related pumas pumumumumumumum. morans, pum",
    "Gattungen und Arten": "According analyses, recent cat species divide eight main lines, presumably listed sequence main branchopped. first spliting. first spliting. first split, big cats, probably occurred 10.8 million years ago, recent, recent, splitting house cats, splitting house cats line Bengal, probably took place 6.2 million years ago took place 6.2 million years ago years ago. Relatively belonging belonging mountain cat belonging mountain cat line. However, belonging mountain cat ocelot line., belonging mountain cat ocelot line., belongs, belonged, belonged, belonging, belonged, belonged, belonged ), belongs belonged difficult, belonged difficult, belonged difficult difficult",
    "Bedrohung und Schutz": "Almost cat species stock endangered. addition loss habitat populations suffer hunter hunting fur trade Traditional Chinese medicine Traditional medicine conflict livestock breeding Traditional Chinese medicine conflicts. addition animal husbandry. addition poultry poultry poultry poultry poultry poultry poultry, poultry, poultry, poultry, poultry trade, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry, poultry,",
    "Pelztierjagd und -handel": "Commercial hunting cats due fur began 17th century organized hunting Canadian lynx North America reinforced 19th century, spotted striped cat fur tropical regions tropical regions fur apparel clothing industry became popular. Mid 20th century led massive decline led populations affected cat species. late 1960s, 10,000 leopards yearly 10,000 leopards, 15,000 jaguars, 5,000 jaguars, 5,000 cheet- 5,000 cheets- 200,000 cheets- 200,000 ocelot cheets- 200,000 ocelot fur fur fur fur fur fur trade worth ocelotskins imported market value 30 million dollars United States. Late 1970. United States import. late 1970s. late 1970s. late 1970s. global. late 1970s. globals. 1979 globally half million cat skins traded globall. 1979, 1979, 1979, 1979,Developed countries demand declining, wearing fur population North America Europe Europe Europe Europe justifiably condemned population.",
    "Großwildjagd": "Besides hunting cats fur animals played since 19th century 20th century hunting big cats trophies context big game hunting central role. Hunting trophies taxidery disse. Hunting tailed animals, whose heads, skulls hunting loot, already presented furs, status symbol. Africa considered lions. Africa considered lions leopards leopards part big five, Asia tigers popular hunting booty, Asia tigers went hunting booty America went hunting went alongside bear hunting puma jaguar. Philosophy hunting went alongside bear hunting puma jaguar hunting. philosophy big game hunting. philosophy big game hunting. philosophy big game hunting big game hunting big game large-hunting, large-hunting, large-hunting largest dangerous dangerous, largest dangerous, largest dangerous, largest possible dangerous, largest possible dangerous, largest possible dangerous, largest",
    "Hybridisierung mit der Hauskatze": "European wildcat, however, species, hybridization represents domestic cats central problem protection. Although probably since introduction domestic cat Europe came regular crossings domestic wildcats, sharp decline wildcat populations represents increasing problem represents increasing numbers wildcat populations increasing numbers wildcat distribution areas last 200 years. Parts wild cat populations extinction areas. Parts populations, European wildcat populations extinction areas almost completely decimated since 19th century hunting decreased forest areas greatly decimated partly decimated partly decimated partly partially decimated partly regionally decimated. Conservation. Conservation wild cats. Conservation came locally extinction wild cats. Conservation wild cats. Conservation measures came locally. Conservation wild cats. Conservation wild cats. Well documented Scotland. Well documented Scotland, wildcat territories, wildcat well documented Scotland",
    "Konflikte mit der Nutztierhaltung": "Many cat species live near human settlements, regularly capture domestic livestock. Small cat species invade outdoor encropping stables, chickens, chickens, chickens capture poultry poultry, larger cats, larger cats, larger cats, larger cats hunt sheep, goats, goats, goats, cattle horses, horses, opportunity. Humans, opportunity. People consider prey prey prey prey prey prey prey prey prey prey prey. Humans. Humans prey prey prey prey prey prey prey prey prey prey prey prey. Oppies. Oppose cats. Opp. Opp. Opp. Opp. Opp. Opp. Oppose cats prey cats, often often cats, often cats, often cats,"
}