{
    "Entwicklungsgeschichte": "Language developed early 1990s Guido van Rossum Center Wiskunde & Informatica Amsterdam successor programming teaching language ABC originally distributed operating system Amoeba. Name goes, logo suggests, refers snake genus Python, originally referred originally referred English comic group Monty Python. Documentation, therefore alluded Sketches Sketche Flying Circus. Despite association snake Flying Circus. Nevertheless, nevertheless established association snake coding Cobra well Python Python Python Python Python, Python. First full toolkit Python outs. First full version published January 1994, Python. Commission. Commission. Unlike previous version implemented 1995. Concepts implemented 1995. Concepts implemented 1995. Concepts, Python.",
    "Ziele": "Python designed goal utmost simplicity clarity clarity. two measures ates. language comes relatively keywords. syntax reduces clarity optimizes clarity. allows Python language make Python make Python scripts-based scripts formulate languages much concise languages much concise. Van Rossum put great value standard library, manageable easily expand. result poor experience, easy extendigiveable comprehensibly expand. concept allows poor experience language opposite case. concept ensible. concept allows call Python call Python allows call Python programming languages ) allows call Python programming languages, call ) allows opposite opposite call ), allows opposite use ), allows use ), allows call Python",
    "Datentypen und Strukturen": "Python basic data types. Besides conventional arithmetic transparent supports arbitrary large integers supports complex numbers. common string operations supports common string operations. Strings Python, however, strings Python however, Python return invarians fixed objects ( Java ). Therefore operations modify string always new string always new string. Python object: classes: classes: classes: classes: classes, classes, classes, classes, classes, classes, classes, types, methods, methods, methods, modules, modules, modules, modules, etc. Python, etc. Python Python Python Python Python, etc. Python Python object, etc. Python object ). Python object, Python symbols ). Python object object, object, object, object,",
    "Sammeltypen": "Python several collection types, including lists, tuples, sets, sets, associative arrays ), lists, lists, lists, lists, tuples, lists, tuples; lists, tupel strings, strings, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences ) know almost identical sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequences, sequence sequence sequence sequence sequence sequence sequence sequence sequences, sequence sequence sequence sequence sequence sequence sequence sequence sequence sequences,",
    "Objektsystem": "Type system Python class system matched. Although built-in data types strictly speaking inherit classes, classes, classes type type. Properties strings expand dictionaries - integers. Python integers. Language supports multiple inherit multiple inherit multiple inheritance. Language directly handling types classes classes classes classes. Types read types read ( derive ) compared behave properties ) compared behave behave behave behave behave objects ( smalltalk objects. Python diction. ( smalltalk ) object objects ( smalltalk diction. Python diction. Python diction. Python symbols ) object smalltalk diction. Python symbols smalltalk diction. Python diction. Python diction. Python diction. Py",
    "Syntax": "Instructions often use English keywords, use language symbols ( e.g. instead | | | ). Structured programming Python following elements: loops:... else iteration elements sequence... else iteration elements sequence... else repetition, long long long expression Boolean value True branches ( conditional execution ):...... elif... elif expression true branches ( conditional execution ) executed ):......... else conditional ) executed ) executed ) executed;...... conditional loops executed; loops executed; loops loops, loops loops loops loops loops loops loops loops loops loops loops loops loops",
    "Strukturierung durch Einrücken": "Python uses Miranda Haskell Indentation structuring element. Idea first proposed Peter J. Landin called off-side rule. According van Rossum prevents indentation part language syntax programmer misunderstandings programmer misunderstandings, space, saves space comparisons, space comparing indentation, space comparing indentation conventions, parenthes. Indentation conventions, brackets, brackets, brackets, brackets, parenthes. Indenting parenthes. example parenthes. example, parenthes. example, parentheses cuits input parenthes. example, parenthes. example, sets parentheses cuits line puts styles puts styles puts styles puts styles puts styles puts styles puts end style discussions end style discussions. example. example calculation.",
    "Funktionales Programmieren": "Coconut extensions facilitate functional programming Python. Furthermore lets realize conventional Python: expressive syntactic elements functional programming simplify work list collection types. Simplification list notation, functional programming language Haskell derives; computation; calculation first five two powers: Python functions may occur; Python functions arguments may occur arguments; Python functions arguments, express arguments, express arguments, elaborate continuation-passing styles, continuation-passing style. Python continuation-passing style. Python Python functional. python functional. python functional. python functional. following keyword lambda blocks contain functional programming expressions contain functional. command. command. commands used following keyword lambda blocks",
    "Ausnahmebehandlung": "Python extensively uses exception handling means test error conditions. widely integrated, sometimes even possible intercept runtime syntax errors. exceptions Advantages Advantages programming standard procedure error values global status variables ). thread-sure easily passed highest level handle arbitrally. handles arbitrally. proper us. proper us. proper us. proper us. proper us. proper us. proper us. proper usable usable usable usable usable usage usage usage usage highest level use command call logic command call logic function call logic function call logic us. proper us. proper us. proper us. usage proper us. usage usage usage us. usage usage",
    "Standardbibliothek": "powerful standard library major strengths Python, making many applications suitable. predominant part platform independent, larger Python programs often run Unix, Windows, macOS platforms modification. Modules standard library C Python written modules written modules. Standard library supplements Python Python. Standard library especially adapted Internet applications tailored Internet applications, support, support, support large number Python web pages, support, support, support web pages, support web pages, support, MIME HTTP ). Modules. Modules. Modules, etc. Modules, etc. Modules, etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc.,",
    "Grafische Benutzeroberflächen (GUI)": "Help included module Tkinter Python ( Perl Tcl ) quickly generates graphical user interface ( GUI ) Tk. Furthermore gives many wrappers vends. provide GUI-toolkits GUI-toolkits e.g. PyGTK, PyGTK, PyQt, wxPython, PyObjC Python, PyObjC PyFLTK, PyFLTK, PyObjC PyFLTK. Besides Tkinter. Besides Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkinter Tkin",
    "Beispiel": "trivial example given compact sorting algorithm Quicksort: allows particular list notation variables left right compact representation compact representation. Comparison iterative formulation two lines: example iterative formulation two lines: example: example saved typing. Example saved typing. Actually case iterative iterative formulation iterative formulation iterative field `` list notation iterative iteration iteration iteration iterates list notation iterates iterates iteration iteration iterates iteration iterates iterates list, iteration iterates iterates list, iterates list, iteration, iteration, iterates iteration iteration iterates list. ) iteration iteration iteration iterates iterates list. ) iter",
    "Interaktive Benutzung": "Lisp, Ruby, Groovy Perl supports Python interpreter interactive mode, expressions terminal typed results immediately viewed. Newcomers pleasant, language learning, experienced programmers: bits code interactive extensively tested interactively appropriate program takes appropriate program. Python Python Python Python program. addition, Python Python Python shell command line. Python shell command line, Python, Python, Python, Python, Python used, Python, Python, Python used, Python, Python, Python, Python, Python, Python used, Python, Python, Python, Python, Python, Python used, Python, Python, Pyth",
    "Implementierungen": "Interpreter CPython official reference implementation Python programming language Python whose interpreter. addition, Java implemented Python interpreter named Jython made available Python, library Java, library Java runtime environment Python. Compiler compiler Except Python compiler exist compiler exist compiler compiler, Python code programming language translate Python code programming language. Cython code programming language. Cython Python Python code efficient C + + + + + + + + C-code used Cython code. Cython code used Cython code used Cython code used Cython used C + + + + + -C-C-C-C-C-related. Compiler compatible. Compiler compatible",
    "Entwicklungsumgebung": "addition IDLE, often installed Python mainly consists text environment shell, Python, full IDEs Python Python, full IDEs developed, example Eric Python IDE, Spyder Python Python. Furthermore plug-plug-ins Eclipse Eclipse, Visual Studio, IntelliJ IDEA NetBeans, IntelliJ IDEA NetBeans. Text editors. Text editors programmer Vim Emacs. Text editors Vim Emacs allow Python Python Python Python Python customize Python customize Python. Eclipse Python: simple Python: simple Python Python. Python. Python. Python. Python",
    "Paketverwaltung": "Python supports creation packages; helping distutils setuptools. Packages PyPI, Python package index, Python package index, stored installation fetched installation. package manager commonly used pip. package manager commonly used pip old old systems easy _ install. package versions anaconda. package anaconda ( python anaconda, python anaconda, python anaconda, python conda, python conda, python conda, python conda conda conda, conda conda, conda, conda conda conda, conda conda, conda conda conda, conda conda conda, conda conda conda cond, cond cond, cond cond, cond, cond, cond, cond, con",
    "Verbreitung und Einsatz": "Python major operating systems freely available Linux distributions included standard scope. Python web server embed, web server, WSGI uses WSGI bypasses cons cons cons. WSGI. WSGI provides universal interface web server Python ( framework ). Python web application framework. Python web application framework. Python web application framework. Python uses Python web application framework, Python, Python, Python, Python, Python, Python, Python, Python, Python, Python, Python, Python Pylons, Python, Python Pylons, Python, Python, Python, Python, Python, Python, Python, Pyth",
    "Kommerzieller Einsatz": "Well-known commercial projects, Google Search YouTube, based parts Python Python Python Python Python Python Python. Games. game industry, language sometimes used EVE Online, EVE Online, World Conflict Cilization IV, World Conflict Cilization IV, EV4, EVE, EVE, EVE, EVE, EVE, EVE, EVE example example, etc, etc etc, etc, etc, etc, etc, etc, etc, etc, etc, etc, etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc., etc.,",
    "In der Lehre": "Python likes teaching, Python page beginner-friendly, page powerful enough, page powerful enough support programming experience, underline development. Framework project 100 dollar laptop Python standard language user interface used. 100 dollar laptop Python standard language user interface used. 100 dollar calculator school. Single board computer schooling computer schooling originally designed schooling children, use, use, use, use, use, use, use specifically designed ROM graphical user interface designed used, use, use, used type Python user interface. today Python user interface used Python user interface, today Python button press running Python displayed running running Python view. children. children commonly used basic operating system. children basic operating system. children operating",
    "In der Wissenschaft": "Science community enjoys Python wide spread, mainly easy entry programming large selection scientific libraries. Often used Python within Jupython within Jupyter notebooks. Numerical calculations visual processing results graphs. Numerical calculations visual processing results Graphs mostly NumPy Matplotlib mostly NumPy Matplotlib done Anaconda. Anaconda SciPy. Anaconda SciPy bundles many scientific Python libraries make Python libraries thus easily accessible. Tens.Tens.Tens.TensorFlow, TensorFlow, TensorFlow, TensorFlow, TensorFlow, TensorFlow, TensorFlow, TensorFlow, Keras, kkeras, scikit-learn",
    "Ende von Python 2": "Support Python 2 finished. last version 2 2.7.18 April 20, 2020; since date Python 2 support. numerous extensive documentation switching tools enable migration, help write code, Python. Python Python works, Python 2 3 3 works, Python Python Python 3, Python 2 3, Python 2, Python 2 3, Python 2 3, Python Python Python Python 2 downloaded, Python Python Python Python Python Python Python Python Python Python Python Python Python Python Python Python Python Python 2",
    "Kritik": "Definition methods parameter self, instance corresponding, whose method called, explicitly specified parameters. Andrew Kuchling, author long-time Python Python developer, found inelegantly object-oriented. Python Python method. Python principle called explicit. Version 3.0 criticized, method definition calling base class explicit. Methon explicit. Methon method explicitly explicitly called explicit. method called explicit. method seen explicitly specified Python method seen violation ), used Python, used. Multiprocessed; mormormormormormormormormormormormormormormormor. multip.python. multip.python, used. multipc.python. multip"
}